{
    "CC1003": {
        "name": "Introduction to Microcontroller Programming",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "A hands-on introduction to programming microcontrollers aimed at students with no prior programming experience. Microcontrollers are small computers used in sensors, consumer electronics, industrial equipment, and Internet of Things devices, to name just a few applications. Students will be introduced to programming and will learn introductory aspects of software design such as the use of variables, data types, conditional statements, loops and functions. These software skills will be developed in the context of microcontrollers. Students will also learn about how to program microcontrollers to interact with simple sensors and actuators using digital and analog inputs and outputs, as well as using serial communication to send and receive messages.",
        "learning_outcomes": "demonstrate a structured approach to software design and problem solvingapply software programming skills to create, analyse and modify computer programsdesign, implement and test simple microcontroller software using high level toolsprogram microcontrollers to interact with peripherals including sensors and actuators",
        "availabilities": [
            "JCU Singapore, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Project report - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CC2003": {
        "name": "Internet of Things Devices and Software",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CC1003 AND EG1012",
        "prerequisites_subjects": [
            "CC1003",
            "EG1012"
        ],
        "description": "A hands-on introduction to building Internet of Things (IoT) devices that incorporate sensors, actuators, and communication with other devices and the Internet. This subject teaches how to develop microcontroller-based systems by the design of both software and printed circuit board hardware to implement a required set of features and solve a problem. Students will also learn how to integrate microcontrollers with simple communication systems in order to upload data to the cloud. Students will complete a design project to conceive, design and build a prototype IoT device.",
        "learning_outcomes": "apply software programming skills to develop efficient and maintainable microcontroller softwaredesign microcontroller software that incorporates sensors, actuators and machine-to-machine communicationselect and justify hardware components to meet design constraintsdesign, assemble and test printed circuit boards that function as add-ons to existing microcontroller development boards",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Project report - (40%) - Group",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CC2510": {
        "name": "Digital Logic and Computing Methods",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1002 OR CP1401",
        "prerequisites_subjects": [
            "CP1401",
            "EG1002"
        ],
        "description": "Section A: Digital Logic Boolean algebra and minimisation, practical design of combinational and clocked synchronous sequential logic circuits; ABEL representation of digital logic; programmable logic devices and programming these devices, logic families and interfacing.Section B: Computing Methods programming engineering applications in structured programming tools and environments.",
        "learning_outcomes": "Section A: Digital Logictranslate an English based requirements statement into a form suitable for implementing as a logic designSection B: Computing Methodsa detailed knowledge of the management principles of multi-module software design and developmentdemonstrate an ability to describe the electrical properties of, and justifiably select between, the commonly used logic family technologies, including EPLD devicesdesign minimum gate count combinational logic circuitsdesign synchronous sequential logic to satisfy state machine requirementsdevelop a top-down programming style using structured programming techniques applied to a common programming language and operating system for the development of maintainable applications from a design specificationdiscuss, in a cohesive and valid manner, the design processes and selection criteria used in digital logic designwrite ABEL programs to realise combinational and sequential logic circuits",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Problem task - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "CC2511": {
        "name": "Embedded Systems Design",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1002 OR CP1300 OR CP1404 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EG1002",
            "CP1300",
            "CP1404"
        ],
        "description": "The design of microprocessor based systems for instrumentation and consumer electronics: microprocessor programming; microprocessor architecture; peripherals; interfacing techniques; embedded C programming and testing; computer aided design (CAD) tools for circuit schematic and printed circuit board design and manufacture; a design project to demonstrate interfacing and real time control of electro-mechanical systems.",
        "learning_outcomes": "justify and apply the design techniques used in the design project and communicate this to othersdesign and construct microprocessor based embedded systems using computer aided design tools to meet specific criteriadescribe and apply appropriate techniques for interfacing instrumentation sensors and actuators for the operation of computer controlled electro-mechanical systemsdescribe and undertake the hardware and software design of real time microprocessor based instrumentation and control systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Design project - prototype - group work 32% Project report - individual 8% - (40%) - Group & Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CC3003": {
        "name": "Internet of Things Systems and Security",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CC2003",
        "prerequisites_subjects": [
            "CC2003"
        ],
        "description": "This subject provides a whole-of-system perspective on the Internet of Things (IoT) with a focus on cloud infrastructure and security. Students learn how to design and implement cloud-based dashboards to act as management and analytics layers in IoT systems. This knowledge is applied as part of a design project to develop a complete end-to-end IoT system. Students also learn about security issues such as software vulnerabilities, authentication, and encryption, in order to be able to design and implement more secure IoT systems and analyse the security of existing systems. Furthermore, students critically analyse the privacy implications and ethical issues regarding pervasive technology in society.",
        "learning_outcomes": "design and critically analyse an end-to-end IoT system for a chosen application domaindesign and implement cloud-based dashboard software for an IoT applicationassess the likely security of an IoT system design and make justified recommendations to improve security and reduce riskexplain common types of security issues and how these can be managedcritically analyse the benefits, risks, and ethical issues related to technology and the resulting implications for professional practice in the field",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Project report - (40%) - Group",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CC3501": {
        "name": "Computer Interfacing and Control",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CC2511 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "CC2511"
        ],
        "description": "Common interfaces to computer controlled equipment such as SPI and USB. Introduction to the physical layer characteristics of local area networks including IEEE 802.x and common industrial control networks, such as Fieldbus. High-level language programming of embedded microcontrollers and Linux systems. The application of real-time operating systems to embedded microcontroller based systems.",
        "learning_outcomes": "differentiate between a range of common computer equipment interfaces and discuss their important benefits and limitationsdifferentiate between common interfaces for sensors and actuators, and discuss how to connect them to existing or planned computerised industrial control and monitoring systemsdiscuss the important physical characteristics of common local area networksdiscuss the specification, design and analysis of real-time systemsdevelop internetworked embedded systems using microcontrollers and/or embedded Linux systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Design project - prototype 28% Project report 12% - (40%) - Group",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CC4510": {
        "name": "Digital System Design",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CC3501 OR ADMITTANCE INTO MASTERS OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "CC3501"
        ],
        "description": "This subject develops the theory and practice of designing logic systems, with a focus on Field Programmable Gate Arrays (FPGAs). A hardware description language is used to design, simulate, and synthesise digital hardware, including both combinational and sequential logic. Topics include: logic design fundamentals, the VHDL language, finite state machines, and designing for testability.",
        "learning_outcomes": "Understand digital design methodologies and the role of programmable logic devicesDesign digital logic based upon system requirementsImplement logic designs in a hardware description languageEvaluate logic designs using hardware simulation tools to test for correctness and issues of timingSynthesise digital logic to field programmable gate arrays (FPGAs) and validate the resulting implementation",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CC4950": {
        "name": "Design Project",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CC3501 AND (CC3910 OR EE3700) AND EE3901",
        "prerequisites_subjects": [
            "EE3901",
            "CC3910",
            "CC3501",
            "EE3700"
        ],
        "description": "This subject will first start with introducing the integration of the IoT system from a technological perspective. It will cover the data communication protocols between devices and platforms: 1) Message Queuing Telemetry Transport (MQTT), which is a machine-to-machine connectivity protocol; 2) Narrowband Internet of Things (NB-IoT), a standard-based low power wide area (LPWA) technology developed to enable a wide range of new IoT devices and services; and 3) RESTful API, an architectural style for an application program interface (API) that uses HTTP requests to access and use data. The second part of this subject will cover how to propose an idea with both technological advantages and business opportunities, how to write a grant application to attract business investors, and how to quickly develop prototypes of their new inventions with an enterprise IoT platform. Overall, this subject is about boosting students' innovation and business skills and nurturing their commercial aspirations.",
        "learning_outcomes": "define a scope, identify resources and tools, assess risks and implement appropriate intervention plans for successful delivery of a projectdemonstrate adherence to professional and ethical responsibilities in project deliveryidentify engineering design techniques on IoT technologies to real world applicationsapply management and leadership skills to develop a solution for a complex design problem",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (20%) - Group & Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Project report - (60%) - Group & Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Proposal - (20%) - Group & Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP1401": {
        "name": "Problem Solving and Programming I",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "In this subject, students will learn problem-solving and coding skills to develop solutions to IT-related problems. Students will apply problem-solving techniques including decomposition, flowcharts and algorithm design. Basic programming using Python will be introduced including the use of selection, repetition and functions. This subject forms a foundation for further programming subjects.",
        "learning_outcomes": "apply problem-solving techniques to develop algorithms in the IT contextapply basic programming concepts to develop solutions",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Study Period 82, Internal",
            "JCU Brisbane, Study Period 84, Internal",
            "JCU Brisbane, Study Period 86, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Study Period 82, Internal",
            "JCU Singapore, Study Period 84, Internal",
            "JCU Singapore, Study Period 86, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External"
        ],
        "assessment": [
            {
                "title": "Performance/Practice/Product > Software development/creation - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP1402": {
        "name": "Internet Fundamentals",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject introduces students to Internet standards, architectures, and technologies to develop fundamental knowledge of network devices, network models, and Internet protocols. Students will gain knowledge of the Open Systems Interconnection (OSI) and TCP/IP models, subnetting, switching, routing, LAN and WAN protocols, and network security. Students will gain experience in network design and troubleshooting strategies.",
        "learning_outcomes": "describe the various components of Local Area Network (LAN) and a Wide Area Network (WAN) computer networksexplain how the Open Systems Interconnect (OSI) and TCP/IP reference models function in designing communications in LAN and WAN environmentsexplain the fundamentals of network security and troubleshooting procedures and practiceplan and implement IP addressing and the TCP/IP protocols to design a LAN and WAN",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Study Period 83, Internal",
            "JCU Brisbane, Study Period 85, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "CP1403": {
        "name": "Design Thinking I",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject provides students with the design process, interpretation, ideation, experimentation, evolution of design solutions, design formulation and design thinking. Students will develop essential design skills of creating, imaging, generating, iterating, communicating and consolidating. Collaboratively students will work together in teams to design, iterate, implement and validate computing solutions. Through projects, students will develop problem-solving skills, communication skills, presentation skills, project management skills and also build creative systems for a range of applications. Students will learn basic approaches to creative group problem solving working in teams in the form of a \"sprint\" event. The Sprint environment will provide students with an opportunity to develop these skills via a short-term 2-day design sprint to collectively analyse a problem then design and partially implement a practical solution, which is a mandatory part of this subject.",
        "learning_outcomes": "apply basic design thinking processesapply basic project management skills for creative IT industriesappraise basic IT systems designapply basic design thinking to business cases",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Study Period 83, Internal",
            "JCU Brisbane, Study Period 85, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Part 1 Sprint Participation 30% Part 2 Self Reflection Task 20% - (50%) - Group & Individual",
                "percent_weighting": 50
            },
            {
                "title": "Part 1 Project Plan 15% Part 2 Project Report 35% - (50%) - Group",
                "percent_weighting": 50
            }
        ]
    },
    "CP1404": {
        "name": "Programming II",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1801 OR CP1401 OR CP1200 OR EG1002 OR CP2200 OR SC1201",
        "prerequisites_subjects": [
            "CP1401",
            "CP1200",
            "CP1801",
            "SC1201",
            "EG1002",
            "CP2200"
        ],
        "description": "In this subject, students will learn fundamental principles and practices of computer programming. Students will learn and apply coding skills in Python as well as software development techniques such as version control, testing and debugging. Students will develop procedural and object-oriented programs with console and graphical user interfaces.",
        "learning_outcomes": "develop and utilise best-practice coding techniques to develop solutionsselect and apply appropriate and efficient data structuresmanage software projects using version control",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Study Period 83, Internal",
            "JCU Brisbane, Study Period 85, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Assignment 2 Software Development Creation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Software development/creation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP1405": {
        "name": "Gamification",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Students are introduced to the concepts and techniques of using 'serious games' and 'gamification' to achieve business goals in areas such as marketing, human resources management, productivity enhancement, training, customer engagement, and innovation. Real-world case studies are used to identify effective strategies, techniques and metrics for serious game and gamification to solve business problems. Legal and ethical issues related to serious games and gamification are introduced.",
        "learning_outcomes": "explain different types of gamification and applicationsapply concepts of motivation and user-based design to gamificationevaluate existing serious games and gamification techniques and applicationsapply concepts and techniques of gamification to create games to achieve business goals",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Project plan - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Serious Game Prototype and Presentation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP1406": {
        "name": "Web Design and Development",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject is an introduction to Web design and development using modern, standards-driven practices and user-centred design principles. Students will explore how the Web works, considering both good and bad design and the need for following standards and best practices. Students will learn to use client-side technologies including HTML, CSS and JavaScript to develop interactive websites.",
        "learning_outcomes": "apply user-centred design principles and methodsdemonstrate best practices in creating standards- based websitesapply HTML, CSS and JavaScript to develop interactive websites",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Study Period 82, Internal",
            "JCU Brisbane, Study Period 84, Internal",
            "JCU Brisbane, Study Period 86, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Assignment 2 Web Development creation - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Website development/creation - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP1407": {
        "name": "Introductory Machine Learning and Data Science",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Data Science is the study of the generalizable extraction of knowledge from data. Being a data scientist requires an integrated skill set spanning mathematics, statistics, machine learning, databases and other branches of computer science along with a good understanding of the craft of problem formulation to engineer effective solutions. This subject will introduce students to this rapidly growing field and equip them with some of its basic principles and tools as well as its general mindset. Students will learn concepts, techniques and tools they need to deal with various facets of data science practice, including data collection and integration, exploratory data analysis, utilising various machine learning algorithms for predictive modeling and descriptive modeling, data product creation and evaluation",
        "learning_outcomes": "Describe what data science is and the skill sets needed to be a data scientistDescribe the data science process and how its components interactExplain in basic terms what Machine Learning means and the significance of Machine Learning in data scienceIdentify differences in various machine learning algorithms, principles and application purposes of each algorithmApply basic tools to carry out data analysis using exemplar machine learning algorithms",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Study Period 82, Internal",
            "JCU Brisbane, Study Period 84, Internal",
            "JCU Brisbane, Study Period 86, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Assignment - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP1409": {
        "name": "Operating Systems and Shell Scripting",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject covers fundamental concepts and algorithms used in modern operating systems. The main topics covered in this subject include an overview to operating systems followed by process management, process synchronization, memory management, storage management, file systems, security and protection, and networks and distributed systems. Students will experience coding command line interfaces in Windows and shell scripting in Linux environment.",
        "learning_outcomes": "describe and explain the fundamental components of a computer operating systemdefine, restate, discuss, and explain the policies for scheduling, deadlocks, memory management, synchronization, system calls, and file systemsdemonstrate understanding of different features across shells in Windows and Linuxdevelop and utilise best-practice coding techniques within Linux and Windows shells to accomplish different tasks",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Assignment - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP1410": {
        "name": "Cybersecurity and Cryptography Fundamentals",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1402 AND CP1409",
        "prerequisites_subjects": [
            "CP1402",
            "CP1409"
        ],
        "description": "This subject provides a comprehensive overview of the various branches of computing security, with a special emphasis on Network and Cryptography concepts. Students will learn about the main definitions, approaches, challenges and tools that are critical in solving problems in the cybersecurity domain.",
        "learning_outcomes": "define cybersecurity and the responsibilities of cybersecurity professionalsuse the CIA and AAA models to explain cybersecurity activitiesdescribe symmetric and asymmetric cryptography systemsexplain how cryptography, steganography and security protocols are used to establish authentication and confidentialitydemonstrate knowledge of network, computer forensics and system administration fundamentals",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP2403": {
        "name": "Information Processing and Visualisation",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MINIMUM OF 12 CREDIT POINTS OF SUBJECTS",
        "prerequisites_subjects": [],
        "description": "Today's world is data and information intensive, but knowledge poor. In this subject students explore the computing skills required to enable basic understanding of data, information processing, and data visualisation. Students use analytic tools to model, analyse, evaluate and design business processes. Relevant themes covered include the information generation, representation, structuring, organisation, storage, retrieval, navigation, human factors in information systems, and use of information. Students also gain hands-on experience in processes and procedures in information processing and management.",
        "learning_outcomes": "describe information processing and management processes and techniques for IT and business contextappraise data and information analytics concepts and proceduresanalyse data and interpret results to generate information for decision makingcompare and contrast information processing tools and systems",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Software Development - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP2404": {
        "name": "Database Modelling",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Introduced in this subject are the principles and concepts of database systems and their importance in today's society. The relational model and various competing models for database and a database query language are introduced and applied. Through this subject students will develop skills in techniques and tools to model, design and implement a database system.",
        "learning_outcomes": "describe and apply the techniques of normalisationapply a database design to a database management systemformulate queries using a database query languageexamine database and database management systems, their features and rationaledevelop a database model using the entity- relationship model",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Assignments - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP2405": {
        "name": "Collective Intelligence and Entrepreneurship",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MINIMUM OF 24 CREDIT POINTS",
        "prerequisites_subjects": [],
        "description": "In this subject students analyse the social and business impact and applications collective intelligence has in a rapidly changing digital world. Students will explore the start-up lifecycle and related Web2.0/3.0 technologies with particular focus on entrepreneurship, e-marketing and human resource management. Technologies and new business models such as crowd sourcing, harnessing the crowd, linked data, etc., will be examined to evaluate how creative problem solvers can take advantage of a global collective intelligence through enhanced information sharing and online collaboration. Students gain skills and experience using emerging crowd platforms to pitch ideas, increase profit, manage well-being, enable business processes and functions and explore new business models",
        "learning_outcomes": "examine collective intelligence and social network technologies and applicationsanalyse business opportunities and challenges of collective intelligence and entrepreneurshipexamine legal, ethical and social issues related to collective intelligencedevelop and align appropriate collective intelligence technologies with entrepreneurship activities",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (15%) - Group",
                "percent_weighting": 15
            },
            {
                "title": "Written > Project report - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Assignment 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP2406": {
        "name": "Programming III",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1404 OR CP1804 OR CP1300",
        "prerequisites_subjects": [
            "CP1804",
            "CP1300",
            "CP1404"
        ],
        "description": "Students will learn how to design, code, test, refactor and debug large and/or complex software programs from supplied specifications using a computer programming language and software development tools, to achieve a well-engineered result.",
        "learning_outcomes": "design and implement a large and/or complex software program from supplied specificationslearn a computer programming language and relevant software development environment to an advance levelcontinue the development of problem solving skills and approaches that effectively support programming",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Assignment 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Software development/creation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP2408": {
        "name": "Design Thinking II",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1403 OR CP1803 OR SC1201 OR ADMISSION TO BACHELOR OF CYBERSECURITY (119110)",
        "prerequisites_subjects": [
            "CP1403",
            "SC1201",
            "CP1803"
        ],
        "description": "This subject provides students with the skills to develop clickable prototypes as a path to creative software solutions. The subject brings together aspects of design thinking, lean principles, and the agile process. Students will learn about the importance of collaborative design and managing teamwork. Students will continue to develop self-reflection to promote students' understanding of their own capacities and an awareness of the knowledge economy. An essential and mandatory component of the subject is participation in a two-day design sprint involving students from all design thinking subjects. This offers students the opportunity to develop mentorship skills and experience rapid prototyping.",
        "learning_outcomes": "demonstrate the use of technology in non-traditional applications and apply IT in unfamiliar settings and contextsgain practical experience in goal-oriented, collaborative IT system developmentrespond to rapid changes in IT system requirementsanalyse concepts of creativity and disruptive innovationappreciate at a high level the interplay between technology and the knowledge economy",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Part 1 Sprint Participation 30% Part 2 Self Reflection Task 20% - (50%) - Group & Individual",
                "percent_weighting": 50
            },
            {
                "title": "Part 1 Project Plan 15% Part 2 Project Report 35% - (50%) - Group",
                "percent_weighting": 50
            }
        ]
    },
    "CP2409": {
        "name": "Network Forensics and Data Communications",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1402 OR CP2012 OR CP2231 OR CP1802",
        "prerequisites_subjects": [
            "CP2012",
            "CP1802",
            "CP2231",
            "CP1402"
        ],
        "description": "Students are introduced to the fundamental of network forensics and the ability to analyse data communications. Students develop skills to examine incoming network traffic, enabling the analysis and identification of network threats before security of the network is breached. Topics addressed in this subject include network analysis, data communications, network troubleshooting, site surveying, and case studies to determine the level of threats.",
        "learning_outcomes": "compare the principles, concepts and techniques used in network performance enhancementanalyse intruder types, the intrusion process and network traffic logsperform static and dynamic analysis of malwareapply network protection techniquesanalyse elements of specific network and transport layer protocols to understand their performance and limitations",
        "availabilities": [
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Singapore, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Case study Assignment 2 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Case study analysis - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP2410": {
        "name": "Algorithms and Data Structures",
        "college": "College of Science and Engineering",
        "prerequisites_string": "6 CP OF CP SUBJECTS",
        "prerequisites_subjects": [],
        "description": "Efficient data structure is of importance in modern IT systems enabling the effective search and sorting in complex databases. Through the use of algorithms, students determine the most efficient processes to design data structures and systems. In this subject students will examine the issues involved in data structures and algorithms, efficient and effective data management and handling, algorithm design and analysis, implementation and indexing and retrieval.",
        "learning_outcomes": "evaluate the efficiency and effectiveness of data structures and algorithmsdemonstrate reasoning about efficiency of algorithmsassess and apply suitable data structures and algorithms to IT systems and applicationsdesign and implement data structures and algorithms",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration 2 - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP2411": {
        "name": "3D Modelling and Animation",
        "college": "College of Science and Engineering",
        "prerequisites_string": "6 CP OF CP SUBJECTS",
        "prerequisites_subjects": [],
        "description": "Introduced in this subject are the concepts and technologies of computer graphics, computer animation and computer visualisation. Students engage in modelling of 3D objects and deploying avatars in games and simulation. Topics covered include polygon modelling, rigging, animation, lighting, physics and dynamics.",
        "learning_outcomes": "demonstrate skills in using modern graphics and animation software tools with emphasis on creating components for game development and simulationapply appropriate rendering and lighting techniquescreate a fully deployable avatar for gamesapply physics and dynamics to models within scenes to create an animation production",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "3D Modelling Project - (60%) - Individual",
                "percent_weighting": 60
            }
        ]
    },
    "CP2412": {
        "name": "Game Design and Technologies",
        "college": "College of Science and Engineering",
        "prerequisites_string": "6 CP OF CP SUBJECTS",
        "prerequisites_subjects": [],
        "description": "In this subject students will examine the link between experience of immersive play and the process of conceiving, designing and implementing a computer game. Areas covered include the principles behind the rules and play of games, player centred design methods and processes and skills in using game development environments.",
        "learning_outcomes": "apply principles of player centred designexplore how games function to create play experiences and social interactionsdesign rules, play mechanics, balance games, and integrate different modalities effectively",
        "availabilities": [
            "JCU Singapore, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (35%) - Individual",
                "percent_weighting": 35
            },
            {
                "title": "Written > Essay (including multi-draft) 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Journal - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Prototype - (30%) - Group",
                "percent_weighting": 30
            }
        ]
    },
    "CP2414": {
        "name": "Network Security",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1402 OR ADMISSION TO BACHELOR OF BUSINESS (20510) and 3 credit points of CP subjects",
        "prerequisites_subjects": [
            "CP1402"
        ],
        "description": "This subject introduces students to network security protocols and technologies. Students will gain knowledge of cryptography and authentication, and learn to ientify and defend against security threats. Students will gain experience in establishing and maintaining secure information and communication systems",
        "learning_outcomes": "Describe symmetric and public-key cryptography systemsExplain how cryptography and security protocols are used to establish authentication and confidentialityIdentify the threats posed to information systems by malicious software and intrudersPlan, implement and configure secure information and communication systems",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Case study part 2 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Case study analysis - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP2421": {
        "name": "Machine Learning for Cybersecurity",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1401, MA1580",
        "prerequisites_subjects": [
            "CP1401",
            "MA1580"
        ],
        "description": "Machine learning is one of the most exciting areas being investigated nowadays with applications suitable to countless of different fields. Not surprisingly, many approaches can also be relevant to Cybersecurity, where the ability to correctly identify and classify new and unknown threats may represent the difference between survival and bankruptcy for companies of all sizes. This subject explores different theoretical models for clustering and classification purposes and discusses how they can be applied to solve concrete problems within the cybersecurity domain like, for example, malware detection.",
        "learning_outcomes": "understand the types of problems that machine learning algorithms can solveidentify differences in various machine learning algorithms, principles and application purposes of each algorithmapply knowledge of machine learning to specific problems relevant to the cybersecurity domain",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (30%) - Group",
                "percent_weighting": 30
            }
        ]
    },
    "CP2422": {
        "name": "Cloud and Data Centre Security",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1401",
        "prerequisites_subjects": [
            "CP1401"
        ],
        "description": "This subject will introduce the various approaches to and professional practice for designing and implementing practical threat management, SaaS, and inline cloud security approaches. Students will gain a general understanding of cloud threat management (detection and response applications), securing public cloud, secure SaaS applications, and virtualized inline security in public cloud. Students will be working in teams on industry relevant case studies and projects to gain actual experience while also improving interpersonal communication skills in a professional context. Successful completion of this hands-on project based course allow students acquire skills to configure, manage, and monitor various cloud security threat prevention elements.",
        "learning_outcomes": "explain the differences between cloud and data centres and their peculiarities from a security perspectivediscuss and apply industry knowledge and best practices into specific case studiesconfigure, manage and monitor different cloud security threat prevention elements",
        "availabilities": [
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Oral > Presentation 1 - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP2423": {
        "name": "Cybersecurity Infrastructure and Management",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1401 AND CP1410",
        "prerequisites_subjects": [
            "CP1401",
            "CP1410"
        ],
        "description": "This subject will introduce the various approaches to and professional practice for designing and implementing cybersecurity infrastructure for prevention and countermeasures. Students will gain a general understanding of vulnerability, threats, countermeasures. Students will also learn theory, best approaches, and practical steps of how to install, configure, and manage firewalls to protect enterprise network architecture. Students will be working in teams on industry relevant case studies and projects to gain actual experience while also improving interpersonal communication skills in a professional context. Successful completion of this hands-on project based course allow students acquire skills to configure, manage, and monitor various cybersecurity threat prevention elements.",
        "learning_outcomes": "design and implement next-generation cybersecurity infrastructurediscuss relevant networking concepts according to different contexts and scenariosidentify the threats posed to information systems by malicious software and intrudersplan, implement and configure secure information and communication systems",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Oral > Presentation 1 - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP2424": {
        "name": "Cybersecurity Risk Management",
        "college": "College of Science and Engineering",
        "prerequisites_string": "12 CREDIT POINTS OF CP SUBJECTS INCLUDING CP1410",
        "prerequisites_subjects": [
            "CP1410"
        ],
        "description": "Cybersecurity risk management is about supporting decision making under uncertainty. This subject describes key principles of risk analysis, risk assessment and risk mitigation for information security using both qualitative and quantitative methodologies that can be applied to business environments of all sizes.",
        "learning_outcomes": "describe common risk management methodologies, approaches and related standardsdevelop well-formed risk statementsdefine common descriptive analyticsdescribe common security metrics and the security data analytics pipeline",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (30%) - Group",
                "percent_weighting": 30
            }
        ]
    },
    "CP2501": {
        "name": "Cloud Computing",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject is to cover emerging topics and technologies related to Cloud Computing, and their applications and implementations. Cloud computing has become a main driver for medium and large scale businesses where challenges arise from big data, and it becomes crucial to experience diverse architectural models and services of cloud computing, and to study the concepts of cloud virtualisation. Main topics covered include: cloud models, cloud computing concepts and technologies, cloud platforms and tools, cloud virtualisation, cloud storage and data management, and application development and deployment using cloud techniques and platforms. Students will acquire hands-on experience through practising on public cloud infrastructures, Amazon Web Services (AWS).",
        "learning_outcomes": "explore cloud computing platforms, models, tools and techniquesdesign and develop scalable applications using cloud computing tools and techniquescritically appraise the working principle of cloud virtualisation, and cloud data managementexplore cloud application programming models to manage big data challenges",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP3000": {
        "name": "Research Topics in Technology",
        "college": "College of Science and Engineering",
        "prerequisites_string": "12 CREDIT POINTS IN CP, SC, OR MA SUBJECTS",
        "prerequisites_subjects": [],
        "description": "Topics to be selected from mathematical software, social impact of computing, logic programming, theory of programming languages, compiler design, computer networks.",
        "learning_outcomes": "students will obtain in-depth knowledge of the selected topic(s)",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "Cairns Nguma-bada, Trimester 2, Internal",
            "Cairns Nguma-bada, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, Internal",
            "Townsville Bebegu Yumba, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Literature review - (70%) - Individual",
                "percent_weighting": 70
            }
        ]
    },
    "CP3101": {
        "name": "Professional Internship",
        "college": "College of Science and Engineering",
        "prerequisites_string": "36CP OF CP SUBJECTS.",
        "prerequisites_subjects": [],
        "description": "This subject is designed to integrate knowledge and skills developed throughout the Bachelor of Information Technology degree in a practical workplace setting. Students undertake an IT related professional placement in a relevant, approved industry workplace and through a number of tasks reflect upon personal and professional growth and evaluate the theory / practice nexus. Students are expected to have completed 36 credit points of CP subjects and be in the final year of study. Students at JCUS should consult Academic Staff.",
        "learning_outcomes": "Apply knowledge and skills developed throughout the degree in a practical workplace environmentDesign and deliver an information technology related project that demonstrates the application of relevant industry knowledge, standards and practices",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 10, Mixed attendance, (Face to Face dates exist for this availability)",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 10, External",
            "Townsville Bebegu Yumba, Study Period 10, Mixed attendance, (Face to Face dates exist for this availability)"
        ],
        "assessment": [
            {
                "title": "Employer final appraisal - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project plan - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Written > Research report - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Self-reflection task - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3102": {
        "name": "Multidisciplinary Project",
        "college": "College of Science and Engineering",
        "prerequisites_string": "36CP OF CP SUBJECTS.",
        "prerequisites_subjects": [],
        "description": "This subject is one of two capstones offered through the Work Integrated Learning (WIL) Program for Information Technology. The subject enables final year students to work together in groups to investigate and develop an IT related project sourced from industry. Capstone subjects allow students to apply and integrate the knowledge, skills and capabilities learned throughout their Bachelor of Information Technology degree while at the same time fostering the development of professional identities and transition to the workplace. Identification of suitable projects occurs through collaboration between the College and industry partner organisations. Students work in groups of up to six with each group having a mix of majors. Students are advised of their allocated group in the first timetabled workshop. It is a requirement that students attend the 3 hour timetabled workshop each week. Students conduct project work in addition to this contact time and receive support and project direction from academics and industry partner for the project's duration. External students are not eligible to enrol in this subject. Students at JCUS should consult Academic Staff.",
        "learning_outcomes": "apply classroom knowledge and skills gained throughout the degree to solve complex and real world industry issues and produce a large scaled project outcomedemonstrate the ability to work collaboratively, in particular in a cross-discipline team and where required to effectively manage and lead a teamevaluate the complexity of working across different discipline areas and contrast and evaluate the relationships between various sectors of professional industrydesign and deliver an information technology related project that demonstrates the application of relevant industry knowledge, standards and practices",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Final Project - (55%) - Group & Individual",
                "percent_weighting": 55
            },
            {
                "title": "Written > Proposal - (30%) - Group & Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Self-reflection task - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "CP3103": {
        "name": "Independent Project",
        "college": "College of Science and Engineering",
        "prerequisites_string": "36CP OF CP SUBJECTS.",
        "prerequisites_subjects": [],
        "description": "This subject is designed primarily for students already employed in a workplace to develop an independent IT related project for the workplace / industry. Students will be required to prepare a project proposal (which would require subject coordinator/lecturer approval) and to complete a project relevant to their degree and workplace. The proposal would be required to demonstrate how the project assists in developing/improving workplace skills; address an industry issue and contribute to industry. This is one of 3 capstone WIL subjects in the final year of the degree (students must complete one of the three) and students are expected to have completed 36 credit points of CP subjects.",
        "learning_outcomes": "evaluate the complexity involved in solving multifaceted industry issues and/or design, organise and produce an effective large scale industry project resultdemonstrate effective oral presentation skills for academic and professional audiencesdesign and deliver an information technology related project that demonstrates the application of relevant industry knowledge, standards and practices",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Mixed attendance, (Face to Face dates exist for this availability)",
            "Cairns Nguma-bada, Trimester 3, Mixed attendance, (Face to Face dates exist for this availability)",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Mixed attendance, (Face to Face dates exist for this availability)",
            "JCU Singapore, Trimester 2, Mixed attendance, (Face to Face dates exist for this availability)",
            "JCU Singapore, Trimester 3, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Mixed attendance, (Face to Face dates exist for this availability)"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Final Project Activities (30% Final Project; 20% Final Supervisor Report) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Proposal - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3401": {
        "name": "e-Strategic Management",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MINIMUM OF 24 CREDIT POINTS",
        "prerequisites_subjects": [],
        "description": "In this subject, students investigate enabling information, communication technologies and the \"big picture\" ramifications for e-strategic management in a global market. Students explore applications of current technologies combined across disciplines to gain competitive advantages, increase growth, enter emerging markets and maintain current markets. The synthesis and analyses will cover e-business, e-commerce, e-marketing, e-government and e-tourism.",
        "learning_outcomes": "critique the main elements of an e-businessdevelop an e-business strategy for a companyevaluate the components of a business modelanalyse the privacy and legal issues surrounding e-business",
        "availabilities": [
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Oral > Presentation 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Project report - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Technical report - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3402": {
        "name": "Content Management Systems",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(CP1404 OR CP1804 AND CP1406 OR CP1806) OR CP2010, AND 24 CREDIT POINTS OF CP SUBJECTS",
        "prerequisites_subjects": [
            "CP1804",
            "CP1406",
            "CP2010",
            "CP1806",
            "CP1404"
        ],
        "description": "In this subject, students will learn about Web-based Content Management Systems (CMS), and use them to develop websites. Students will review CMS tools and technologies and evaluate them in terms of client requirements. Students will develop sites using front-end (client-side) and back-end (server-side) programming while considering issues of interface and user experience, accessibility and Web standards.",
        "learning_outcomes": "appraise the role of content management technologies to acquire, organise and present web contentcreate and deploy websites using Content Management Systems, including creation and editing content, creating custom templates or themes, and performing site managementExamine installation and maintenance considerations for modern websites",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Performance/Practice/Product > Website development/creation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Project - (50%) - Group",
                "percent_weighting": 50
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3403": {
        "name": "Data Mining",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(CP2403 AND CP2404) OR (18 CREDIT POINTS OF UNDERGRADUATE SUBJECTS INCLUDING 6 CREDIT POINTS OF CP SUBJECTS)",
        "prerequisites_subjects": [
            "CP2404",
            "CP2403"
        ],
        "description": "Students will be introduced in this subject to fundamental data mining and big data concepts, technologies, and applications. Topics include data mining, data warehousing, big data analytics, data visualisation, pre-processing, clustering, classification and association rules mining. Students will gain hands-on experience with popular data mining tools and develop skills in practical data mining and big data analytics.",
        "learning_outcomes": "explain the notion of big data, information intelligence, data mining, data profiling, data cleaning and data integration and warehousinganalyse and apply data mining techniques and toolsexamine the working principles of data mining and knowledge discovery in databasesrelate intelligence informatics to data warehousing, big data and data miningassess the potential benefits, risks, issues and challenges associated with big data and data mining",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Oral > Presentation 1 - (10%) - Group",
                "percent_weighting": 10
            },
            {
                "title": "Written > Project report - (30%) - Group",
                "percent_weighting": 30
            }
        ]
    },
    "CP3404": {
        "name": "Information Security",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP2414 OR CC3501 OR (18 CREDIT POINTS OF SUBJECTS INCLUDING CP1402)",
        "prerequisites_subjects": [
            "CP1402",
            "CC3501",
            "CP2414"
        ],
        "description": "This subject introduces current challenges in computer security and why security is difficult to achieve. It explores the importance of information security, and looks at the fundamental attacks (i.e. malware and social engineering attacks) including how to defend against them. It also covers the study of basic and advance cryptography, mobile devices security, access control and identity management, compliance and operational security.",
        "learning_outcomes": "define information security, and describe the challenges of securing informationdescribe different types of authentication services/credentials, and how awareness and training can provide increased securityexplain payloads of malware and types of social engineering psychological attacksexplain the legal and ethical issues involved in information securitydescribe symmetric/asymmetric cryptography, and evaluate the strengths of secure systems",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Assignment 2 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Assignment 1 - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP3405": {
        "name": "Design Thinking III",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP2408",
        "prerequisites_subjects": [
            "CP2408"
        ],
        "description": "This subject provides students with an advanced conceptual framework to understand the applications of creative technologies in the various disciplines including science and business. Relevant topics include: project management for IT industries, risk management, time management, project communication, project design and implementation and project deployment. Students will learn basic approaches to creative group problem solving in teams. An essential component of the subject is participation in a two-day design sprint involving students from all design thinking subjects. This offers students the opportunity to develop mentorship skills and experience rapid prototyping in the form of mandatory two-day \"design sprint\" event.",
        "learning_outcomes": "evaluate modern tools and technologies to meet project requirementsapply IT system development and industry standard project development skillsexamine non-traditional modern project management and system developmentapply practical experience in advanced interactive design technologiescommunicate technical information through reports and presentations",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Self-reflection task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Prototype - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Part 1 Project Plan 15% Part 2 Project Report 35% - (50%) - Group",
                "percent_weighting": 50
            }
        ]
    },
    "CP3406": {
        "name": "Mobile Computing",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(CP1404 OR CP1804 AND 18 CREDIT POINTS OF CP SUBJECTS) OR (CP1404 OR CP1804 AND ADMITTANCE TO BACHELOR OF ENGINEERING (COURSE CODES 102809 OR 116209)) OR (CP1404 OR CP1804 AND ADMITTANCE TO BENG BIT (COURSE CODES 112609 OR 116309 OR 103310 OR 112610)) OR (CP1404 OR CP1804 AND ADMITTANCE TO BENG BSC (COURSE CODES 102909 OR 116409 OR 102910))",
        "prerequisites_subjects": [
            "CP1804",
            "CP1404"
        ],
        "description": "This subject enables students to explore the mobile ecosystem by creating mobile applications. Students will learn how to design, test, and deploy mobile applications using a modern mobile platform. The subject gives students an opportunity to appreciate and understand the capabilities of modern mobile devices by creating mobile applications that feature gesture control, device motion, GPS positioning, and social network interoperability.",
        "learning_outcomes": "Gain practical experience using the software components of a modern mobile platform, and the hardware components of modern mobile devicesCreate and deploy mobile applications that adhere to the guidelines of a modern mobile platformAppreciate major aspects of the mobile ecosystem and how they relate to the knowledge economyEvaluate and discuss the technical aspects of mobile computing",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Software development/creation - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3407": {
        "name": "Advanced Software Engineering",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(CP1404 OR CP1804 AND 18 CREDIT POINTS OF CP SUBJECTS) OR (CP1404 OR CP1804 AND ADMITTANCE TO BACHELOR OF ENGINEERING (COURSE CODES 102809 OR 116209 OR 116309))",
        "prerequisites_subjects": [
            "CP1804",
            "CP1404"
        ],
        "description": "Students are introduced to advanced software methodology, techniques and project management in software engineering. Topics covered include advanced requirements analysis, configuration management, process management, refactoring, high level design, software metrics and verification and testing and debugging.",
        "learning_outcomes": "design and implement appropriate solutions in one or more application domains using software engineering approachesapply software verification, testing, and validation for quality assurance in software developmentworking as part of a team to develop and deliver quality software artefactsapply appropriate skills to re-engineer existing software",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Project plan - (20%) - Group",
                "percent_weighting": 20
            },
            {
                "title": "Written > Project report - (40%) - Group",
                "percent_weighting": 40
            }
        ]
    },
    "CP3408": {
        "name": "Game Engine and Simulation",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(CP1404 OR CP1804) AND 18 CP OF CP SUBJECTS",
        "prerequisites_subjects": [
            "CP1804",
            "CP1404"
        ],
        "description": "In this subject students gain applied knowledge in areas including artificial intelligence, intelligent agent simulation, system analysis and interactive software design. The skills developed and technologies used to further this knowledge include the design of game and simulation, intelligent agents required for the creation of game and simulation, and game and simulation programming methods and techniques.",
        "learning_outcomes": "examine the process of designing, implementing and producing games using a game enginedesign, program and test computer simulations or game programs using a variety of modern tools and technologiesapply modelling concepts related to game and simulation developmentdevelop programming knowledge and skills with contemporary programming languages related to game enginedemonstrate applied artificial intelligence and agent knowledge in game simulation design",
        "availabilities": [
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Game Prototype Presentation - (40%) - Group",
                "percent_weighting": 40
            },
            {
                "title": "Written > Self-reflection task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP3413": {
        "name": "Information Processing and Visualisation",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MINIMUM OF 12 CREDIT POINTS OF BU AND/OR BX SUBJECTS",
        "prerequisites_subjects": [],
        "description": "Today's world is data and information intensive, but knowledge poor. In this subject students explore the computing skills required to enable basic understanding of data, information processing, and data visualisation. Students use analytic tools to model, analyse, evaluate and design business processes. Relevant themes covered include the information generation, representation, structuring, organisation, storage, retrieval, navigation, human factors in information systems, and use of information. Students also gain hands-on experience in processes and procedures in information processing and management.",
        "learning_outcomes": "describe information processing and management processes and techniques for IT and business contextappraise data and information analytics concepts and proceduresanalyse data and interpret results to generate information for decision makingcompare and contrast information processing tools and systems",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Software development/creation - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3414": {
        "name": "Ethical Hacking",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP2422, CP2423",
        "prerequisites_subjects": [
            "CP2423",
            "CP2422"
        ],
        "description": "This subject introduces Ethical hacking and penetration testing techniques to the students. They will be learning tools used by Ethical Hackers to examine the security of a device or network. Students will learn to systematically investigate a computer network for possible vulnerabilities and gain an understanding of the countermeasures that a company can take to minimise the effect of vulnerabilities.",
        "learning_outcomes": "identify and analyse the stages an ethical hacker requires to take in order to compromise a target systemidentify tools and techniques to carry out a penetration testingevaluate security techniques used to protect system and user datainstall, configure, use and manage hacking software on a closed network environment",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Scenario-based learning activity - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP3415": {
        "name": "Strategy and Governance",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP2424",
        "prerequisites_subjects": [
            "CP2424"
        ],
        "description": "This subject focuses on the definition of best practices to enable organisations to operate highly adaptive and responsive cyber resilience processes. Managing cyber resilience operations is a critical management tool for understanding risk status and making important investment decisions on cyber risk. Students will learn the language of cyber resilience and the potential threats to organisations, gaining an active understanding of the cyber threat landscape and the planning and testing of response scenarios. The concept of 'responsive governance' is also being explored. In a rapidly changing cyber risk environment, in fact, the policies and procedures of today are not necessarily valid for long periods of time and may not remain valid between typical annual review cycles, hence students need to learn how to adapt to an ever evolving scenario.",
        "learning_outcomes": "define and implement Cybersecurity models and strategies to support different business needs and requirementsanalyse and design frameworks to handle risk-based information security and service-continuitycompare different widely used international standards (e.g. ISO 27001, PCI-DISS, NIST CSF etc.) and understand strengths and weaknesses of eachanalyse and design different approaches to continuously monitor assets and performance in a typical business setting",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (30%) - Group",
                "percent_weighting": 30
            }
        ]
    },
    "CP3416": {
        "name": "Behavioural Cybersecurity",
        "college": "College of Science and Engineering",
        "prerequisites_string": "36 CREDIT POINTS OF CP OR MA SUBJECTS WITHIN THE DEGREE",
        "prerequisites_subjects": [],
        "description": "Gaining a full understanding of how to protect a cyber-environment requires not only computer and IT knowledge but also a deep understanding of human behaviour. This subject explores psychological and human factors to support traditional technical, computational and analytic approaches, with the goal of offering a more holistic and comprehensive understanding of the modern cybersecurity landscape. An overview of Gamification and how to apply games in the context of cybersecurity training is also included.",
        "learning_outcomes": "apply profiling techniques and personality psychology to the domain of cybersecuritycompare and evaluate different social engineering practicesdescribe Gamification elements and their applications to cyber security",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Participation > Class participation - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Case study analysis - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Project report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP3417": {
        "name": "Cybersecurity for Operational Technology",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP2423",
        "prerequisites_subjects": [
            "CP2423"
        ],
        "description": "Operational Technology (OT) is hardware and software that detects or causes a change through the direct monitoring and/or control of physical devices, processes and events common in Industrial Control Systems (ICS). In the world of critical infrastructure, OT may be used to control power stations or public transportation. As this technology advances and converges with networked tech, the need for OT security grows exponentially. In this subject students will be exposed to the latest trends and methodologies to properly assess, evaluate and mitigate the risks that modern critical infrastructure is exposed to.",
        "learning_outcomes": "identify the challenges, risks and vulnerabilities modern critical infrastructure is exposed toinvestigate and compare possible strategies for defences in a variety of industrial settingsimplement and test possible solutions to secure industrial networks, without disrupting operations or risking non-compliance with common industry standards and requirements",
        "availabilities": [
            "JCU Singapore, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Case study analysis - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Scenario-based learning activity - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP3418": {
        "name": "Best Practices in Cybersecurity",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP3414",
        "prerequisites_subjects": [
            "CP3414"
        ],
        "description": "In this subject students will work on cybersecurity projects using the latest tools and strategies as a basis to plan, secure and/or test different types of infrastructure by following industry best practices. Students are encouraged to select a project from the industry, local community, or university research community. Cybersecurity projects will be developed in teams to work on industry relevant topics to provide practical experience and best practices in a professional context.",
        "learning_outcomes": "acquire practical experience on actual cybersecurity projectsapply appropriate cybersecurity tools and technologies to meet project requirementsdiscuss and implement specific cybersecurity standards and best practicesconvey technical information clearly through presentations, demonstrations and documentation",
        "availabilities": [
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (30%) - Group & Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Case study analysis - (30%) - Group",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "CP3501": {
        "name": "Deep Learning",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Deep learning has become a hot topic and emerging technology to solve complex real world problems in almost all areas. This subject enables students to explore basics and fundamentals of deep learning, to practise deep learning algorithms to solve complex problems, and to experience various tools and modules. Topics covered include: basics in deep neural networks, various deep network architectures, parameter optimisation, applications in classification, and programming with deep learning modules using Python.",
        "learning_outcomes": "explore the principle and theory of deep learning algorithms and modelsevaluate the efficiency and effectiveness of deep learning algorithmsapply deep learning algorithms to solve complex real world problemsdesign deep learning algorithms and solutions for an application",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Project report - (25%) - Group",
                "percent_weighting": 25
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (25%) - Individual",
                "percent_weighting": 25
            }
        ]
    },
    "CP3511": {
        "name": "Cloud Computing",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject is to cover emerging topics and technologies related to Cloud Computing, and their applications and implementations. Cloud computing has become a main driver for medium and large scale businesses where challenges arise from big data, and it becomes crucial to experience diverse architectural models and services of cloud computing, and to study the concepts of cloud virtualisation. Main topics covered include: cloud models, cloud computing concepts and technologies, cloud platforms and tools, cloud virtualisation, cloud storage and data management, and application development and deployment using cloud techniques and platforms. Students will acquire hands-on experience through practising on public cloud infrastructures, Amazon Web Services (AWS).",
        "learning_outcomes": "explore cloud computing platforms, models, tools and techniquesdesign and develop scalable applications using cloud computing tools and techniquescritically appraise the working principle of cloud virtualisation, and cloud data managementexplore cloud application programming models to manage big data challenges",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "CP4011": {
        "name": "IT Honours Project (Part 1 of 3)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "A major project in computer science and information technology, to be carried out under the supervision of a staff member. The project will require a survey of the relevant literature, an analysis of the problem to be solved, the design and implementation of the solution and verification and evaluation of the results. Progress reports are required during the year and a complete account of the work done must be given in the final report, which should include a critical appraisal of the objectives, techniques and results of the project.",
        "learning_outcomes": "apply skills gained in the verbal presentation of ideas and technical material via formal seminar presentationsproduce a substantial piece of technical writing in the form of a thesis or report",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of Assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP4012": {
        "name": "IT Honours Project (Part 2 of 3)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "A major project in computer science and information technology, to be carried out under the supervision of a staff member. The project will require a survey of the relevant literature, an analysis of the problem to be solved, the design and implementation of the solution and verification and evaluation of the results. Progress reports are required during the year and a complete account of the work done must be given in the final report, which should include a critical appraisal of the objectives, techniques and results of the project.",
        "learning_outcomes": "apply skills gained in the verbal presentation of ideas and technical material via formal seminar presentationsproduce a substantial piece of technical writing in the form of a thesis or report",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of Assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "CP4013": {
        "name": "IT Honours Project (Part 3 of 3)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "A major project in computer science and information technology, to be carried out under the supervision of a staff member. The project will require a survey of the relevant literature, an analysis of the problem to be solved, the design and implementation of the solution and verification and evaluation of the results. Progress reports are required during the year and a complete account of the work done must be given in the final report, which should include a critical appraisal of the objectives, techniques and results of the project.",
        "learning_outcomes": "apply skills gained in the verbal presentation of ideas and technical material via formal seminar presentationsproduce a substantial piece of technical writing in the form of a thesis or report",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of Assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "EE2201": {
        "name": "Circuit Theory",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1012 and MA2000. Allow concurrent enrolment for MA2000.",
        "prerequisites_subjects": [
            "EG1012",
            "MA2000"
        ],
        "description": "AC circuit theorems and network analysis. Sinusoids and phasors. Frequency response, transfer function, stability, Bode diagrams, locus diagrams, resonance. Two port networks. The Laplace transform, transient analysis using the Laplace transform.",
        "learning_outcomes": "to demonstrate competence in the application of available techniques including mesh and nodal analysis; circuit reduction techniques; frequency response characteristics; two-port network parameters; transient analysis",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Examination - In class - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "On-course assessment: Consisting of two assignments worth 10% each and Practicals worth 5% - (25%) - Individual",
                "percent_weighting": 25
            }
        ]
    },
    "EE2300": {
        "name": "Electronics 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1012",
        "prerequisites_subjects": [
            "EG1012"
        ],
        "description": "Section A: Conductors, Insulators, N-type and P-type Semiconductors, Band Gap, PN Junction, Diodes, Transistors (BJT, JFET, MOSFET), Operational Amplifiers, Sensors and Transducers, Power Supplies. Section B: Full- and Half-Wave Rectifiers, Wave-shaping Circuits, Peat Detectors, Level Restorers, Ripple Factor, Load Line Analysis, Transistor Biasing, Transistor Frequency Response, Small Signal Analysis, Integrators, Differentiators, Zero Crossing Detectors, Rectifiers, and Function Generators.",
        "learning_outcomes": "describe fundamental aspects of semi-conductors and other electrical materials and their role in the operation of electrical circuitsdesign a discrete diode and transistor circuitsanalyse a purposed-designed electronic circuitexplain the electronic circuit based and application of Operational Amplifierdesign aspects of an amplifier circuitdesign aspects of a power supplydesign a purpose-designed electronic circuit",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Written > Self-reflection task - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EE3010": {
        "name": "Digital Signal Processing",
        "college": "College of Science and Engineering",
        "prerequisites_string": "At least 48 credit points from subjects in Bachelor of Engineering or Admission to Master of Engineering (Professional)",
        "prerequisites_subjects": [],
        "description": "Software and Theory: The sampling and processing of signals in a digital environment, including effects of sampling, aliasing, time domain to frequency domain transforms, convolution and correlation of sequences, window and filter specification, specification and design of IIR and FIR filters. Hardware: Analogue to digital and digital to analogue converters, direct digital synthesis. Digital down conversion, decimation and interpolation. Digital signal processing engines.",
        "learning_outcomes": "specify and select components required for a DSP based radio receiverwrite specification and use to design digital FIR and IIR filtersdefine the characteristics of sampled signals and mechanisms for samplingexplain the principles, application and interpretation of Convolution and Correlation (in terms of digital signal processing)describe the principles, application and interpretation of Discrete and Fast Fourier Transformsexplain the principles, application and interpretation of windowing techniques, the Z- transform and Bilinear Z-transformexplain the properties and limitations of DSP hardware",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (65%) - Individual",
                "percent_weighting": 65
            },
            {
                "title": "Written > Examination - In class - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Assignment - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EE3300": {
        "name": "Electronics 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE2300 OR ADMITTANCE INTO MASTERS OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE2300"
        ],
        "description": "Tuned amplifiers and oscillators. Power supplies: linear and switched mode. Large signal and power amplifiers (Class A, B, C, D). Feedback, frequency compensation of operational amplifier circuits. Practical operational amplifier circuits. Electronic multipliers and comparators. Planning, managing and implementing a Group Design Project.",
        "learning_outcomes": "ability to plan, manage and implement a group project to meet set milestones, budget and performance specificationsto develop an understanding of the principles and constraints of designing electronic circuitsto develop the capability to design regulated power supplies, oscillators and amplifiersto write design proposals, a design report and present a seminar on an electronic design project",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Case study analysis - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "EE3400": {
        "name": "Power Engineering 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE2201 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE2201"
        ],
        "description": "The knowledge provided by this subject includes: Fundamentals of power engineering; Single phase and three phase power system modelling and analysis; Construction, modeling and performance analysis of rotating electric machines (direct current and alternating current), as well as induction motors; Steady state characteristics of synchronous machines; Transmission lines parameters, transmission modelling and performance analysis; Introduction to power flow analysis, bus admittance matrix, and use of numerical method for power flow analysis; Introduction to stability analysis of power systems; Power quality and control of power system; Symmetrical components and their networks; Fault analysis (single line to ground, line to line, double line to ground).",
        "learning_outcomes": "demonstrate an understanding of the fundamental concepts of power system transients and their analysis techniquesmanipulate the equations governing power transmission linesshow competence in the various levels of power system modellings availabledemonstrate understanding of the techniques used for power system analysisdemonstrate detailed knowledge of their characteristics, the steady state performance of synchronous machines",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Case study analysis - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Simulation activity - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EE3600": {
        "name": "Automatic Control 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1012 AND MA2000 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "MA2000",
            "EG1012"
        ],
        "description": "System Modelling: Linear, non-linear, time invariant, regulator and servomechanisms. Modelling system dynamics by transfer functions, block diagrams, root locus, Bode and Nyquist plots.System Response: Transient response of second order systems. Steady state response, steady state errors, frequency response.Stability: simple stability tests, Routh Hurwitz, root locus, Bode and Nyquist.Controller Design: Performance specification, PID, lead and lag compensators.",
        "learning_outcomes": "demonstrate a competence in assessing and improving the dynamic performance of continuous time systems using classical control systems analysis and design techniques",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "On-Course assessment, some of which may be invigilated - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "EE3700": {
        "name": "Communications Systems Principles",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE2201",
        "prerequisites_subjects": [
            "EE2201"
        ],
        "description": "This subject aims to present the basic principles that underlie the analysis and design principle of modern digital communication systems. This subject involves the transmission of information in digital form from a source that generates the information to one or more destinations. In this subject, we cover the following topics: Probability and Stochastic Processes, Modulation Schemes, Optimum Receiver for AWGN Channels, An Introduction to Information Theory, Error Control Coding, Multiple Access Techniques, and Multiple Antenna Systems. The Software-Defined Radio will also be introduced. After the study of this course, the students should be able to apply advanced mathematic tools and analysis methodologies in modern communications systems, to design and evaluate the performance of optimum receivers for various modulation methods when the channel corrupts the transmitted signal by the addition of white Gaussian noise, and analyse the fundamental limits on digital communications from information theory perspective etc.",
        "learning_outcomes": "apply the mathematic tools and models in modern communications systemsdesign and evaluate the performance of various digital modulations and optimum receivers for signal transmission over a communication channelanalyse the fundamental limits on digital communications from an information theory perspectiveimplement error control coding in digital communication to achieve reliable transmission through a noisy channeldesign and integrate the building blocks of modern communications systems using high-level programming tools with software-defined radio",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "EE4010": {
        "name": "Analog Signals and Filters",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE2201 OR ADMITTANCE INTO MASTERS OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE2201"
        ],
        "description": "Wave propagation. Transmission lines: characteristic and input impedance, lossless, lossy and distortionless lines. Smith Chart, impedance matching. Introduction to filter networks, practical frequency responses, terminations, frequency and impedance scaling and transformation of low-pass types to high-pass, band-pass or band-stop types. Butterworth, Chebyshev, Cauer-Chebyshev and Bessel filter types. Passive and active filters including ladder structures, cascaded biquad sections, active ladder simulation and switched capacitor filters. RF filters: coupled resonator LC, helical, cavity, dielectric and ceramic filters. Phase locked loops and their applications. Frequency synthesis.",
        "learning_outcomes": "analyse and design active filters and switched capacitor filtersanalyse and design phase locked loopsanalyse and design practical low pass filters incorporating frequency and impedance scaling and using transformation to other filter typesexplain the principles of wave propagation and operation of transmission lines. Learn matching and analysis techniquesexplain types and basic properties of RF filtersexplain analog signal transmission",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Examination - In class - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Group design project but individual written report submission - (20%) - Group & Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Group & Individual",
                "percent_weighting": 20
            }
        ]
    },
    "EE4400": {
        "name": "Power Engineering 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE3400 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE3400"
        ],
        "description": "This subject provides the theoretical and practical background knowledge required to understand, design and carry out planning for electrical power systems. The essential elements concerning the generation, transmission, and distribution of electric power are presented. Stability of power system will be a focus of this subject and both angle and voltage stability issues will be discussed. The techniques commonly employed to protect power systems from the systems faults will be highlighted. This subject will also cover the fundamentals of power electronics as well as power quality, origin of harmonics and their effects on electrical equipment and distribution systems. This subject will also look at the control of power flows within a system and the economic dispatch of the power flow. The basic elements that make up an electricity bill are presented, together with the reasons that justify various tariff structures. The purpose of use of energy storage technologies such as pumped storage is explained in a simple way. This subject will also look at the engineering and economic aspects of distributed renewable energy technologies such as solar, wind, and the other commercially available renewable energy technologies. In relation to solar energy focus will be on solar energy resources, solar photovoltaic (PV) materials and electrical characteristics, photovoltaic systems, and their applications. In relation to wind energy focus will be on wind resources, wind power, and wind turbine technologies, modelling and simulation of wind power operation. This subject will conclude by presenting a lecture on smart grid, its characteristics and benefits to both utilities and electricity consumers.",
        "learning_outcomes": "demonstrate an understanding of power electronic switching circuits and their applications to variable speed electrical machines, power supplies and invertersdevelop a significant power system augmentation plan and have the capability to competently use commercial software packages for load flow and fault analysisdevelop detailed knowledge about electric machinesdemonstrate understanding the analytical techniques used for power system operation and planning purposesdemonstrate understanding the properties and behaviour of power electronic devices",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Case study analysis - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EE4500": {
        "name": "Electrical and Electronic Engineering Design",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE3600 AND EE3300 AND (EE3001 OR EE3010) OR ADMITTANCE INTO MASTERS OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE3600",
            "EE3300",
            "EE3010",
            "EE3001"
        ],
        "description": "Application of contemporary design methodologies to resolve complex problems in Electrical and Electronic Engineering; examination of case studies in success and failure of designs and design processes; consideration of the whole systems approach to design and the implications for engineering practice.",
        "learning_outcomes": "understanding of, and capacity to utilise, a whole systems approach to designawareness of, and capacity to discuss, contemporary issues in the design of electrical and electronic systemscompetence in communication skills appropriate to professional design workdetailed understanding of selected design examples, exercises and case studies",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (20%) - Group & Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Reflection/reflective task 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Technical report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "EE4600": {
        "name": "Automatic Control 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EE3600 OR ADMITTANCE INTO MASTER OF ENGINEERING (PROF)",
        "prerequisites_subjects": [
            "EE3600"
        ],
        "description": "<b>Section A</b> - Sampled-Data Systems: Uses classical (frequency-domain transfer function) techniques in the analysis and design of digital controllers for the control of analogue plants, termed sample data systems. Plants and controllers are modelled using the z-transform which leads to rational transfer functions allowing for the usual pole/zero terminology and system performance specification and analysis. <b>Section B</b> - Modern Controller Design: Uses modern (time-domain state space) techniques in the analysis and design of controllers for continuous time plants. This section starts with developing state models of systems from both physical properties and transfer functions. It then investigates techniques for the design of controllers for systems that are modelled in state-space form such as the pole-placement technique. Associated with this are the concepts of controllability, observability and state feedback controller design",
        "learning_outcomes": "demonstrate a competence in assessing and improving the dynamic performance of sample data systems using classical and modern control system analysis and design techniquesdesign a control system applying PLCs in typical industrial manufacturing systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "EG1000": {
        "name": "Engineering 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject introduces you to the concept of an engineer as a professional problem solver, discussing the processes involved in applying the engineering method to problems, the issues surrounding modern engineering practice (such as ethics and sustainability), and how to effectively communicate during and after the engineering project. Topics covered include i) Engineering in society (professional bodies, learned societies; ethics and professional responsibility), ii) Engineering communication (technical report writing; seminar presentations; teamwork; hand sketching; AutoCAD), iii) Engineering problem solving, design and management (engineering analysis; use of engineering software; open-ended problem solving; the design process; selection of alternatives; economic evaluation; project planning and resource management) and iv) Engineering Safety (occupational health and safety; duty of care; legislation; safe management of workplaces).",
        "learning_outcomes": "identify the role of, and relationships between, each major engineering discipline, while also recognising the broader function of engineering in societydemonstrate appropriate and competent use of written, oral, and pictorial communication skills throughout a range of engineering activitiesrecognise and use systematic approaches to engineering design through the guided application of these in several specific design tasksapply teamwork, management and leadership skills in the solution of design problems and practice formal techniques for productive team interactionsimplement various practical stills for university life including study methods, time management, and on- and off-line information sourcingrecognise the importance of ethics and sustainability in modern engineering practice and explain its relevance and implications for a specific problem",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (55%) - Group",
                "percent_weighting": 55
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "EG1002": {
        "name": "Computing and Sensors",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Computer programming is introduced as a tool to solve engineering problems. The MATLAB programming language is taught with specific applications from all engineering disciplines. Variables, conditional statements, loops, functions, exception handling, formatted input/output, debugging, profiling, algorithm design, and numerical analysis including floating point formats are covered. The subject introduces sensor technologies, and includes the acquisition and visualisation of data from Internet of Things devices.",
        "learning_outcomes": "recognise common programming structures such as variables, data types, loops, conditional statements and functions, and be able to apply them within simple pieces of softwaredesign and implement Matlab software that solves common engineering problemspractice good software design principles such as modularisation, the effective use of subroutines, and clear commentingdemonstrate an understanding of numerical rounding, truncation, and error in computational solutionseffectively use spreadsheets for data analysis and manipulationappropriately process data across its lifecycle from acquisition to analysis and visualisation",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Software development/creation - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Test/Quiz 2 - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "EG1010": {
        "name": "Process Engineering",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Introduction to chemistry, systems, sustainability, the chemical process industry and related chemical concepts. Topics covered include: Introduction to the periodic table, atoms, ions, elements, valency. Molecules, chemical bonds and the chemical formulae. The mole, units of mass, volume and concentration. Types and properties of materials: solids, liquids and gases. The ideal gas law. Chemical reactions: stoichiometry, conversion, yield, limiting reactant, oxidation and reduction. Mass balances with and without reaction, degrees of freedom analysis, definition of basis, phase equilibrium, element cycles, and chemical processes with recycle and purge. Examples an applications discussed include: environmental systems (N, P and C cycles), climate change, chemical process unit operations (evaporators, mixers, filters, reactors), tropical and local industries (sugar, ethanol, copper, nickel, aluminium), other chemical process industries such as petrochemical, agricultural, medical and mineral processing applications. Subject Learning",
        "learning_outcomes": "define key physical and chemical properties or reactions from tables and graphsidentify a symbolic description of mass flows throughout a chemical or physical processcalculate conservation of mass equations related to reactive and non-reactive systemsanalyse element cycles, climate change and interactions between environmental and engineered systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Test/Quiz 2 - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "EG1011": {
        "name": "Statics and Dynamics",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH1005 or (Physics and Maths C)",
        "prerequisites_subjects": [
            "PH1005"
        ],
        "description": "<b>Statics:</b> Review of forces and moments: Couples, Equivalent systems; Objects in Equilibrium: Reactions, Static equilibrium, Free-body diagrams; Analysis of Structures: Trusses, Frames and Machines; Distributed loads; Internal Forces and Moments: Bending moment and Shear force diagrams. <b>Dynamics:</b> Review of kinematics and kinetics of particles: Curvilinear motion of particles; Relative motion of two particles; Work-energy methods; Kinematics and kinetics of rigid bodies: General plane motion; Relative motion; Kinetics of rigid bodies.",
        "learning_outcomes": "gain knowledge of the fundamentals of engineering statics and dynamicsuse techniques for analysing forces, structures and the performance of mechanismsuse techniques for problem identification, formulation and solution",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (55%) - Individual",
                "percent_weighting": 55
            },
            {
                "title": "Written > Test/Quiz 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Assignment - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EG1012": {
        "name": "Electric Circuits",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject includes: Introduction to electrical signals, circuit elements, dc circuit theory, and transient response: Electrical concepts, Electrical units and calculations used to apply them; Linearity; Energy transformations in electric circuits containing resistors, capacitors and inductors; Theory and applications of ideal operational amplifiers. This subject will depend on mathematical skills developed in Mathematics B and/or MA1000, including algebra and some calculus. The goal of this subject is to develop competency in a core set of electric circuit concepts and analytical techniques that can be applied to a wide range of problems and which will be useful to all engineering disciplines as well as forming the foundation for further study in Electrical and Electronic Engineering. This subject requires substantial practice at the techniques being studied rather than a rote memorisation process. Consequently, there is a focus on, and expectation of, students diligently completing a substantial number of analytical exercises each week in order to develop a robust understanding of the techniques.",
        "learning_outcomes": "solve problems for electrical circuits that have linear relationships between voltage and currentdiscuss and apply electrical principles and analysis techniques in applicationsdesign simple electrical circuits to satisfy basic engineering specificationsaccurately and efficiently analyse simple circuits operating under transient and steady state conditionscommunicate a problem, its solution and the strategy used to solve it, with clarity and according to professional standards",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Written > Project report - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "EG2010": {
        "name": "Materials Science and Engineering",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject comprises an overview of materials science and engineering, classification, properties and applications of materials. The materials science part is more related with the structure and properties of materials while the materials engineering analyses the impact of these structural properties and processing techniques on the final materials performance. Understanding the interrelationship between processing, structure, properties and performance is the ultimate objective of this subject. Topics covered in this subject are: metals including alloys, ceramics, polymers, composites, atomic structure and bonding, crystal structures, mechanical properties, phase diagrams, electrical and optical properties.",
        "learning_outcomes": "describe and summarise key properties of metal, ceramic, polymer and composite materialsexamine phase diagrams and crystal structure of different materialsanalyse material properties (mechanical, thermal, optical and electrical) and their implications on process selection and final applicationcombine knowledge on materials science and engineering with experimental and analytical skills",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Literature review - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (25%) - Group",
                "percent_weighting": 25
            }
        ]
    },
    "EG3000": {
        "name": "Introduction to Systems Engineering and Project Management",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1000 AND EG1002 AND EG1010 AND EG1011 AND EG1012 AND MA1000 AND MA1003 AND (PH1005 OR EG1001) OR 36 CREDIT POINTS",
        "prerequisites_subjects": [
            "MA1003",
            "EG1012",
            "EG1010",
            "EG1001",
            "EG1002",
            "PH1005",
            "EG1000",
            "MA1000",
            "EG1011"
        ],
        "description": "This subject introduces Systems Engineering and Project Management as applicable to contemporary engineering projects. Systems Engineering is a rigorous, repeatable and methodical approach to solving the complex technical problems often encountered in industry and beyond. The approach starts with an identification of a problem and the need for a new or improved system to be developed. This problem is explored and understood before the requirements for the new or improved system are to be developed and then analysed and articulated clearly. Potential solutions to the problem are then identified and evaluated against the requirements before a preferred solution is selected for subsequent design and development. Systems Engineering is a multi-disciplinary and collaborative approach to engineering and aims to develop solutions that not only meet requirements but are also balanced across the entire system lifecycle (including production, utilisation, support and disposal phases). Systems Engineering also closely links and integrates with non-technical disciplines and in particular Project Management. Project Management methodology and tools and techniques are explored through project life cycle and phases; activity networks; time management; cost management; physical resource management; quality management; contract management; project monitoring, information and control systems and sustainable practices",
        "learning_outcomes": "communicate effectively, including written and oral and other forms, in a professional environmentcompare approaches and concepts in a range of engineering management problems including dealing with complexity and uncertaintycombine sustainable practices while planning, designing and managing projectsmanage professional and ethical responsibilities and abide by them while delivering projectsexamine various systems engineering and project management tools and concepts for performance evaluation, auditing and successful delivery of projectsdefine a scope, develop a Work Breakdown Structure, identify resources, produce cost estimate and budgeting for a projectidentify risks by using risk analysis techniques, assess their effects on a project scope and timeline and implement appropriate intervention plans",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Written > Project report - (45%) - Individual",
                "percent_weighting": 45
            }
        ]
    },
    "EG3001": {
        "name": "Finite Element Analysis",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG1002 AND EG1011 AND MA2000",
        "prerequisites_subjects": [
            "MA2000",
            "EG1002",
            "EG1011"
        ],
        "description": "Students will learn fundamental theory of numerical methods in engineering and will learn to apply such methods in the analysis of various thermal, static and dynamic mechanical problems. The complementary numerical theory and application sections will be taught in parallel during the semester to provide context for one another and to expose graduates to the wide variety of numerical tools available to today's engineers. Within the theory section of the subject, students will learn the fundamentals and implementation of a variety of numerical methods; specifically the finite element method (FEM) and the discrete element method (DEM). The main topics of FEM include: matrix analysis methods; the derivation of element stiffness matrices of spring and bar elements as well as stiffness matrices of quadrilateral elements for plane elasticity, shell and solid elements; work equivalent forces; the concept of natural coordinates and isoparametric element formulation; numerical integration and gauss points and for DEM include: introduction to DEM and its applications, hard particle collision dynamics in DEM, classic and regularized Coulomb laws. Students are exposed to the theory underlying the FEM and DEM. Therefore, upon successful completion of this subject students can conceptualize alternative FEM and DEM procedures for different projects and ensure that used methods are based on fundamental principles. In the application proportion of the subject, students will be trained in the use of the ANSYS commercial FEM package for static and dynamic mechanical problems, as well as in the interpretation and analysis of results. Students will learn the place of numerical software in the design workflow and will graduate with practical skills in analysis.",
        "learning_outcomes": "assess numerical model accuracy, determine sources of errors, and implement systematic approaches to problem decomposition that facilitate solution (EAC2.1b,c,d)produce written analysis briefs that effectively and concisely report the approach and outcome of computational modelling (EAC3.2b)develop practical experience in the application of commercial finite element packages to solve static and dynamic mechanical problems in engineering (EAC1.3a)explain the fundamental numerical mathematics behind a variety of numerical methods allowing informed use of such methods in practice (EAC1.2a)identify which numerical method is most appropriate for a given engineering application, including selection of the most suitable sub-class (EAC2.2b, c,d)",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Project report - (40%) - Group & Individual",
                "percent_weighting": 40
            },
            {
                "title": "ANSYS workshop: 15% Coding workshop: 15% - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "EG4011": {
        "name": "Thesis Part 1 of 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(72 CREDIT POINTS IN 46110 OR 102810 OR 102809 OR 116209) OR (96 CREDIT POINTS IN (46210 OR 102910 OR 102909) OR (96 CREDIT POINTS IN (103310 OR 112610 OR 1112609 OR 116309))",
        "prerequisites_subjects": [],
        "description": "A major engineering project consisting of application of advanced laboratory, field or computer techniques for the research, design or solution of an engineering problem. Each student will work on a topic from a list presented by his/her engineering discipline. Multiple disciplinary topics are encouraged. Topics are based on research interests of academic and research staff and are often based on real world problems in cooperation with local and regional industry. Projects often take advantage of James Cook University's unique location, in the tropics and in close proximity to reef and rainforest World Heritage Areas. Components of this subject include planning; literature survey; research, development or design; proposal/progress written report and oral presentation; formal thesis document and seminar presentation of final results.",
        "learning_outcomes": "search, interpret and critically evaluate relevant research literatures to justify research gaps, objectives and methodologiesdesign experiments/simulation and fluently apply advanced engineering techniques and systems approach to develop engineering solutions to complex problemsplan and execute engineering and research projects of significant size and scopeanalyse and interpret data, derive conclusions and evaluate project outcomes against appropriate criteriacommunicate project objectives and outcomes with scientists, engineers and the community at large in written and oral formsidentify and critically appraise current developments, advanced technologies and emerging issues",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Presentations (invigilated) 25% and Thesis (invigilated) 75%",
                "percent_weighting": 75
            }
        ]
    },
    "EG4012": {
        "name": "Thesis Part 2 of 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "EG4011",
        "prerequisites_subjects": [
            "EG4011"
        ],
        "description": "A major engineering project consisting of application of advanced laboratory, field or computer techniques for the research, design or solution of an engineering problem. Each student will work on a topic from a list presented by his/her engineering discipline. Multiple disciplinary topics are encouraged. Topics are based on research interests of academic and research staff and are often based on real world problems in cooperation with local and regional industry. Projects often take advantage of James Cook University's unique location, in the tropics and in close proximity to reef and rainforest World Heritage Areas. Components of this subject include planning; literature survey; research, development or design; proposal/progress written report and oral presentation; formal thesis document and seminar presentation of final results.",
        "learning_outcomes": "ability to locate, select and use both print and electronic resources for researchdemonstrate a capacity for original thought and independent investigationdevelop and practise sound oral and written communication skills, in presentation of a progress report and thesis document and in presentation of a technical seminargain experience in application of advanced engineering techniquesgain experience in project planning and demonstrate time management skills",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Presentations (invigilated) 25% and Thesis (invigilated) 75%",
                "percent_weighting": 75
            }
        ]
    },
    "EG4013": {
        "name": "Asset Management, Maintenance and Reliability",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(EG1000 AND EG1002 AND EG1010 AND EG1011 AND EG1012 AND MA1000 AND MA1003 AND (PH1005 OR EG1001)) OR 36 CREDIT POINTS",
        "prerequisites_subjects": [
            "MA1003",
            "EG1012",
            "EG1001",
            "EG1011",
            "MA1000",
            "EG1002",
            "EG1010",
            "PH1005",
            "EG1000"
        ],
        "description": "This subject includes: Overview of sustainable asset management; maintenance practices; spare parts and warehouse management; life cycle cost of machinery; computerised maintenance management systems; relevant ISO standards; failure analysis; reliability centred maintenance; failure mode, root cause analysis (RCA), DMAIC, effects and criticality analysis; condition monitoring practices; environmental considerations; other related issues.",
        "learning_outcomes": "analyse basic reliability concepts and perform statistical analysis involvedapply sustainable asset management concepts, techniques and effective strategies in an industrial organisationpractise basic management considerations and implications of decisions relating to machine maintenance, interaction with the workforce, and asset turnoverintegrate the training skills capable of applying the course knowledge on assignment type problems, the tasks/problems of which are real industry scenarios",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Technical report - (50%) - Individual",
                "percent_weighting": 50
            }
        ]
    },
    "MA0020": {
        "name": "Preparatory Mathematics",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "Basic arithmetic and algebra skills with applications including fractions. Functions, including linear and quadratic with graph sketching. Trigonometry. Simultaneous equations, introduction to logarithms and exponential functions. Introduction to calculus with applications: graphical interpretation and simple rules.",
        "learning_outcomes": "demonstrate fundamental mathematical skills to solve introductory mathematical problems using techniques of arithmetic, algebra, functions and graphs, trigonometry and differential calculusapply standard mathematical laws, definitions and procedures involving: precedence, expansion and factorisation, indices, exponentials and logarithms, graph sketching, trigonometry and differentiationapply logical thinking to problem-solve in a mathematical context by forming, manipulating and solving equations and formulaedemonstrate skills in writing mathematics",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 19, External"
        ],
        "assessment": [
            {
                "title": "Written > Examination - In class - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Examination (College administered) - (50%) - Individual",
                "percent_weighting": 50
            }
        ]
    },
    "MA1000": {
        "name": "Mathematical Foundations",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1020 OR MA0020 OR Maths B OR Maths C OR Admission to 116209 or 116409 or 116309",
        "prerequisites_subjects": [
            "MA0020",
            "MA1020"
        ],
        "description": "Algebra including partial fractions and the binomial theorem; analytic geometry; functions and graphs; exponential and logarithmic functions; trigonometry; differentiation, including implicit differentiation and related rates; stationary points, curve sketching; simple integration; matrix algebra. The subject is designed for students with an OP of 10 or better. Students who do not have this level of preparation will be encouraged to consider MA1020 to build their foundation in Mathematics.",
        "learning_outcomes": "manipulate and solve algebraic equations involving non-integer powers and exponential, logarithmic, trigonometric and polynomial functionssketch graphs of different functions including conic sections to analyse and interpret the important features of the mathematicsdifferentiate and integrate algebraic expressions involving non-integer powers and exponential, logarithmic, trigonometric and polynomial functionsapply methods of algebra and differential calculus to solve problemscommunicate mathematical thinking incorporating the concepts and methods presented in the course",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Test/Quiz 2 - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "MA1003": {
        "name": "Mathematical Techniques",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1000 OR MA1011 OR MA1009",
        "prerequisites_subjects": [
            "MA1009",
            "MA1011",
            "MA1000"
        ],
        "description": "To develop knowledge and advanced analytical skills in the fields of differential and integral calculus, differential equations, series, linear algebra and complex numbers through independent and collaborative learning. To equip students with the techniques required for the application of integral and differential calculus, differential equations and linear algebra in disciplines where these concepts are used.",
        "learning_outcomes": "define hyperbolic functions and describe their properties; define inverse trigonometric and inverse hyperbolic functions and describe their propertiessolve first order differential equations and second order differential equations with constant coefficients, including non-homogeneous cases and apply these methods to word problemsuse convergence tests to determine properties of series and power series. Determine power series representations of functionssystematically solve a system of linear equations; compute and understand the role of the determinant in a matrix equation; solve a matrix equation using the matrix inverseunderstand the rectangular, polar and exponential forms of a complex number. Perform the four standard arithmetic operations and find roots using complex numbers. Solve equations involving complex numbersdifferentiate quantities on curves defined by parametric equations; understand and use the concepts of the differential and linear approximation for functions of a single variable and apply Newton's method to solve nonlinear equations involving a single variableuse techniques presented to evaluate integrals analytically. Use the trapezoidal rule and Simpson's rule to evaluate integrals numerically. Apply integrals to determine volumes of solids of revolution, arc length and surface area of revolutioncommunicate mathematical thinking incorporating the concepts and methods presented in the subject",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 3, Intensive, (Face to Face dates exist for this availability)"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Test/Quiz 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Problem task - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "MA1020": {
        "name": "Preparatory Mathematics",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This subject is suitable for anyone who has not studied Mathematics Methods (Queensland, or equivalent) or for those who require a refresher. MA1020 prepares students for MA1000 or for other University courses and subjects that require Mathematics Methods as a prerequisite. Suitably experienced students may be directed to enrol in MA1000 instead. Basic arithmetic and algebra skills with applications including fractions. Functions, including linear and quadratic with graph sketching. Trigonometry. Simultaneous equations, introduction to logarithms and exponential functions. Introduction to calculus with applications: graphical interpretation and simple rules.",
        "learning_outcomes": "demonstrate fundamental mathematical skills for application to quantitatively-based University level subjectssolve introductory mathematical problems using techniques of arithmetic, algebra, functions and graphs, trigonometry and differential calculusapply standard mathematical laws, definitions and procedures involving: precedence, expansion and factorisation, indices, exponentials and logarithms, trigonometry and differentiationmanipulate and solve equations and formulae including: linear, quadratic, cubic and simultaneous equationsgraph linear, quadratic, cubic and standard trigonometric functions",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 3, Intensive, (Face to Face dates exist for this availability)",
            "JCU Brisbane, Study Period 82, Internal",
            "JCU Brisbane, Study Period 84, Internal",
            "JCU Brisbane, Study Period 86, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, External",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 3, Intensive, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Examination - In class - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "MA1022": {
        "name": "Essential Maths",
        "college": "Academy Division",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "In <i>Essential Maths</i>, you will develop mathematical knowledge, conceptual understanding and skills through investigative and explorative approaches to learning. These approaches provide opportunities for you to work individually, as well as collaboratively and cooperatively in teams. This subject is designed in ways that encourage you to develop positive and productive attitudes towards mathematics. You will participate in learning experiences that have relevance to you personally and to a range of work contexts and possible future study pathways. <i>Essential Maths</i> involves the study of Foundational Mathematics [Arithmetic and Algebra], Applied Geometry [Perimeter, Area, and Volume], Trigonometry, Pythagoras, and Cartesian Plane.",
        "learning_outcomes": "Interpret and use appropriate mathematical terminology, symbols and conventionsInterpret, clarify, analyse, model and solve problemsAnalyse, organise and communicate information via written, symbolic, pictorial and graphical formsIdentify and apply mathematical rules, formula and procedures to foundational mathematical problemsUse technology to justify conclusions, solutions or propositions through logical explanations and sequences in everyday language and/or mathematical language",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Examination (College administered) - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Participation > Online participation - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "MA1580": {
        "name": "Foundations of Data Science",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1000 OR MA1020 OR MA0020 OR Maths B",
        "prerequisites_subjects": [
            "MA0020",
            "MA1020",
            "MA1000"
        ],
        "description": "This subject will provide students with an overview of data science as a discipline as well as an introduction to a number of topics that play fundamental roles across various subjects in this area. Students will learn different forms of representing and pre-processing data for further analysis and visualisation. They will also learn principles of algorithm analysis that will allow them to assess and compare the scalability of different algorithms to be studied across other subjects in the realm of data science. Core elements of this subject include: An Introduction to Data Science and Big Data; Data Types and Representation; Essentials on Data Visualisation of Tabular Data; Data Pre-Processing; Data Wrangling and Tidying; Algorithm Analysis; Case Studies; Software Practice (R).",
        "learning_outcomes": "explain what data science is about and the areas that play major roles within the realm of data scienceexplain and exemplify the most common forms of data types and representationsidentify and describe at a conceptual level a core collection of simple yet powerful techniques for data visualisation in the realm of data scienceconceptually describe and apply a core collection of elementary techniques for data pre-processinginterpret and explain, at a conceptual level, results of algorithm analysesapply common data representation and data pre-processing techniques, such as wrangling and tidying, using the software package and language R",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Research report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "MA2000": {
        "name": "Mathematics for Scientists and Engineers",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1003",
        "prerequisites_subjects": [
            "MA1003"
        ],
        "description": "Statistics, partial derivatives; line integrals, multiple integration, vector calculus; revision of ordinary differential equations, Fourier series, Laplace transforms; partial differential equations; matrix algebra and eigenvalue problems.",
        "learning_outcomes": "introduction to topics in geometry, vector calculus, differential equations and linear algebra with emphasis on their implementation in engineering applicationsto develop and exercise skill in developing models of physical phenomena and to become familiar with standard techniques for solving associated mathematical problems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Examination - In class - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "MA2011": {
        "name": "Discrete Mathematics for Computing",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Algebra and arithmetic to a year 10 standard",
        "prerequisites_subjects": [],
        "description": "Discrete mathematics is the mathematics of computing. You will explore the fundamental theories of logic and proof, the abstract concepts of relations, functions, recursion and induction, and graph structures and counting principles. Through active practice and independent problem-solving, you will develop precise thinking, abstraction and generalisation skills that are central to all areas of computer science and software engineering.",
        "learning_outcomes": "analyse the logical structure of arguments and assess their validityapply appropriate techniques to solve problems and formulate and prove simple theoremsexplore patterns and apply abstract concepts in familiar and unfamiliar contexts",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "JCU Brisbane, Trimester 1, Internal",
            "JCU Brisbane, Trimester 2, Internal",
            "JCU Brisbane, Trimester 3, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Problem task - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Workbook - (60%) - Individual",
                "percent_weighting": 60
            }
        ]
    },
    "MA2210": {
        "name": "Linear Algebra",
        "college": "1555",
        "prerequisites_string": "MA1003",
        "prerequisites_subjects": [
            "MA1003"
        ],
        "description": "This subject provides an important foundation in Linear Algebra necessary for further studies in mathematics, data science and engineering. Topics include: properties of matrices, determinants and matrix transformations, the four fundamental subspaces and Singular Value Decomposition, systems of equations, solutions to eigenvalue/eigenvector problems, and continuous and discrete least squares approximations for functions and data sets. Also, the benefits and limitations of numerical solutions to problems in Linear Algebra are examined. Application of solution methods are carried out by hand and using computer software such as MATLAB.",
        "learning_outcomes": "explain the mathematical concepts, fundamental theorems and definitions of Linear Algebra and their applicationdescribe the properties of matrices and their use in Linear Algebraderive and apply solution methods to common Linear Algebra problemsimplement solutions to Numerical Linear Algebra problems using MATLAB",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Examination - In class - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Log/logbook - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "MA2211": {
        "name": "Discrete Mathematics",
        "college": "1555",
        "prerequisites_string": "Maths B OR MA1020 OR MA0020",
        "prerequisites_subjects": [
            "MA0020",
            "MA1020"
        ],
        "description": "Mathematical reasoning is built on the principles of abstraction and generalisation, and the fundamental concept of logical proof. You will explore theories of logic and proof, the abstract concepts of relations, functions, recursion and induction, and graph structures and counting principles. These are central themes throughout mathematics, computer science and beyond. Through active practice and independent research, you will develop skills in rigorous and creative thinking and precise writing and thereby build strong foundations for analysing, solving and communicating complex problems.",
        "learning_outcomes": "analyse the logical structure of arguments and assess their validityapply appropriate techniques to solve problems and formulate and prove simple theoremsexplore patterns and apply abstract concepts in familiar and unfamiliar contextscommunicate mathematical theorems and their proofs with clarity and precision",
        "availabilities": [
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Problem task - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Workbook - (60%) - Individual",
                "percent_weighting": 60
            }
        ]
    },
    "MA2405": {
        "name": "Advanced Statistical Modelling",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1401 OR BZ2001 OR MA2401 OR SC2202 OR SC2209 AND MA1000",
        "prerequisites_subjects": [
            "SC2209",
            "MA1000",
            "BZ2001",
            "MA1401",
            "MA2401",
            "SC2202"
        ],
        "description": "This subject includes theories and practicals on statistical methods in the applied sciences. The first part of the subject focuses on various aspects of the least square method, including structure of linear models, parameter estimation, inference techniques (including bootstrapping and permutation test), prediction, model diagnostics, and model selection. In the second part of this subject, students will be introduced to models for different data types in the framework of Generalised Linear Models. This includes modelling of binary, count and positive continuous data.",
        "learning_outcomes": "integrate statistical principles, methods, techniques and tools covered in this course to plan and execute a statistical analysisdemonstrate sound knowledge of the theories that underpin the ordinary least squares regression and generalised linear modelseffectively integrate and execute statistical theories in Rretrieve, analyse, synthesise and evaluate outputs produced from Revaluate, synthesise and communicate findings from statistical modelling to end-users",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Essay (including multi-draft) 1 - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "MA2830": {
        "name": "Data Visualisation",
        "college": "1555",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "We have entered the era of big data. The ability to take data - to be able to understand it, to process it, to extract value from it, to visualise it, to communicate it - that will be a hugely important skill in the next decades. Data visualisation plays an important role in data science. Data visualisation investigates paradigm and techniques to transform various data into images that effectively and accurately represent information about the data. This course will introduce students to the fundamentals of data visualisation that focus on how data visualisation can solve a wide range of practical data interpretation problems arising in many applications. It will include the following topics: basic concepts of data visualisation, data representation & abstraction, marks and channels, visualisation design and analysis of techniques, interaction visualisation design, and advanced topics for visualisation. In addition to basic concepts, design approaches and techniques of data visualisation.",
        "learning_outcomes": "demonstrate sound knowledge of the basic theory, principles and concepts that underpin data visualisation techniques and strategiesapply related Visualisation principles and approaches to analyse, evaluate and improve visualisationdemonstrate effective skills to create interactive visualisationapply storytelling principles for designing and effective communicationsemploy software (Tableau) to analyse and visualise data, and design and implement visualisation projects",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Case study analysis - (35%) - Individual",
                "percent_weighting": 35
            },
            {
                "title": "Written > Problem task - (35%) - Individual",
                "percent_weighting": 35
            }
        ]
    },
    "MA2900": {
        "name": "Mathematics Content Knowledge for Middle School Teaching",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1000 OR ED1491",
        "prerequisites_subjects": [
            "ED1491",
            "MA1000"
        ],
        "description": "This subject is designed to deepen the mathematical content knowledge of those who intend to teach across the Foundation to 10 Australian Curriculum: Mathematics, with a focus on middle school content and pedagogies. The content in this subject is aligned with the six Mathematics curriculum content strands: Number, Algebra, Measurement, Space, Statistics and Probability.",
        "learning_outcomes": "illustrate the role of context in mathematics and numeracyinvestigate and communicate mathematics concepts and procedures using mathematical language, symbols and diagramsdevelop strategies for teaching and learning which incorporate the Australian Curriculum: General Capabilities, including critical and creative thinking, and numeracyuse deep content knowledge to describe and explain the links between mathematics content areas in the Australian Curriculum: Mathematics",
        "availabilities": [
            "JCU Online, Study Period 86, External"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (50%) - Group & Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Workbook - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "MA3210": {
        "name": "Probability and Stochastic Processes",
        "college": "1555",
        "prerequisites_string": "MA2000 AND (MA2210 OR MA2201)",
        "prerequisites_subjects": [
            "MA2201",
            "MA2000",
            "MA2210"
        ],
        "description": "This subject will provide students with fundamental concepts of probability theory, random variables, and notions of random processes with applications. The theoretical foundations will be studied alongside with laboratory practice using a computer language such as MATLAB and/or R. Topics include: Elementary Probability: Counting and Probability Rules; Random Variables and Probability Distributions: Continuous and Discrete Cases; Multiple Random Variables and Functions of Random Variables; Statistical Properties of Random Variables: Expectation and Moments; Important Discrete and Continuous Distributions; Sequences of Random Variables and Random Vectors; Random Processes: Characterisation, Properties and Special Processes; Stochastic Systems, Noise and Spectrum Estimation; Applications (e.g. filtering, signal processing, dynamic systems identification)",
        "learning_outcomes": "describe and explain fundamentals of probability theory, random variables, and random processes, both in continuous as well as in discrete spacesapply the fundamentals of probability theory and random processes to mathematically model practical problems involving uncertaintyapply the fundamentals of probability theory and random processes to determine theoretical solutions to the created modelsperform simulations of the real problems and the corresponding mathematical models and solutions using a computer language such as MATLAB or R",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (60%) - Individual",
                "percent_weighting": 60
            },
            {
                "title": "Written > Problem task - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "MA3211": {
        "name": "Mathematical Modelling and Differential Equations",
        "college": "1555",
        "prerequisites_string": "MA2000 AND (MA2210 OR MA2201)",
        "prerequisites_subjects": [
            "MA2201",
            "MA2000",
            "MA2210"
        ],
        "description": "This subject provides students with hands-on mathematical modelling skills for problems that involve dynamical systems. Emphasis will be on mathematical/computer models that will be parameterized with real-world data, such that they can be used to learn about or predict changes over time in the real world. The modelling skills and mathematical techniques learned can be applied to many areas, and we will look at examples from disciplines such as ecology and demography (population growth and decline over time), social sciences (changes among social states), physical models and epidemiology (spread of infectious diseases). You will gain experience in applying mathematical models to real-world problems, by going through the steps of the modelling cycle: from translating a societal or scientific question into a mathematical model to analysing the model and interpreting the results in the context of the original problem. This subject is suitable for students interested in postgraduate industry work or in a research pathway that involves modelling, and for students interested in (applied) mathematics (incl. education, engineering, biology).",
        "learning_outcomes": "translate a verbal problem into an algebraic, numerical, visual or conceptual model of a system that can be analysed to understand and predict changes in natural systems over timeconstruct a mathematical model and employ analytical, graphical, and computational tools, to analyse the behaviour of models under changing conditions, particularly by solving difference and differential equationsparameterize a model with real data, also utilizing tools from statistics/ probability theory and validate models and interpret their outcomes, recognising strengths and limitations",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Weekly Assignments - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Problem task - (60%) - Individual",
                "percent_weighting": 60
            }
        ]
    },
    "MA3212": {
        "name": "Optimisation and Operations Research",
        "college": "1555",
        "prerequisites_string": "MA2000 AND (MA2210 OR MA2201)",
        "prerequisites_subjects": [
            "MA2201",
            "MA2000",
            "MA2210"
        ],
        "description": "This subject covers linear programming (formulations, graphical solutions); the Simplex Method for solving Linear Programs; duality; network optimisation (link and path flow formulations for networks); shortest-path algorithms; integer optimisation (formulations); introduction to non-linear optimisation.",
        "learning_outcomes": "formulate a problem as a linear programming modelsolve a linear programming problem with a graphical method and the simplex algorithmformulate linear programs for networks, as well as the shortest path algorithmformulate simple integer programming modelsapply the Karush-Kuhn-Tucker condition to find the properties of the optimal solution to a non-linear optimisation problemuse MATLAB to solve optimisation problems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "MA3405": {
        "name": "Statistical Data Mining for Big Data",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA2405 OR MA2000 OR SC2202 OR SC2209",
        "prerequisites_subjects": [
            "SC2209",
            "MA2000",
            "MA2405",
            "SC2202"
        ],
        "description": "Recent advances in technology makes it possible to collect, store and analyse very large data sets. Consequently, the contemporary scientist must be skilled in extracting important information embedded in large and complex data sets if they are to offer advances in knowledge to industry, business, research and societies of the 21st century. Moreover, employers are increasingly demanding that graduates can make important discoveries by interrogating large data sets. This subject will provide the bridge between mathematical theory and applied computing methods via the R programming language to give students a strong grounding in statistical learning methods for analysing Big Data sets. A range of supervised and unsupervised learning methods will be covered.",
        "learning_outcomes": "translate between mathematical, visual and conceptual characterisations of statistical learning methods suitable for Big Dataevaluate large and complex data sets using appropriate statistical modelling techniquesdesign, implement and validate supervised and unsupervised machine learning systemsimplement statistical models in the R computing environmentlearn techniques for coping with large data sets",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Project report - (50%) - Individual",
                "percent_weighting": 50
            }
        ]
    },
    "MA3831": {
        "name": "Natural Language Processing, Web Scraping and Large Data Processing",
        "college": "College of Science and Engineering",
        "prerequisites_string": "CP1404 AND MA3405",
        "prerequisites_subjects": [
            "MA3405",
            "CP1404"
        ],
        "description": "This subject will provide students with cutting-edge tools and techniques for data science. There are two parts to this subject. In the first half of the subject, student will explore natural language processing (NLP), web scraping and APIs to harvest data with Python and explore the data science workbench approach to managing production pipelines of work that can be re-used in different data science projects. In the second half of the subject, student will focus on computer models and software designed to handle Big Data sets in a distributed and/or parallel fashion. Particular focus will be given to distributed and parallel computing using Map-Reduce/Hadoop and similar models for processing Big Data sets.",
        "learning_outcomes": "understand and apply new data science skills, knowledge and techniques to solve problems in data science using NLPapply data science skills, knowledge and techniques to solve problems in data science NLP projects with a focus on web scrapingunderstand how to deploy data science projects into production pipelinescompare and evaluate different systems and approaches for high-performance and large-scale computing for analytics for standard data and big datamanage and prepare data using standard management frameworks for the purpose of transforming, cleaning to ensuring classical characteristic outcomes are achievedexamine and deploy data processing tasks in the Hadoop ecosystem for big data",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Case report 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Project report - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Technical report - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "MA3832": {
        "name": "Neural Network and Deep Learning",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA3405 OR MA5405 AND CP1404",
        "prerequisites_subjects": [
            "MA5405",
            "MA3405",
            "CP1404"
        ],
        "description": "This subject in a continuation from MA3405/MA5405. In this subject, students will learn the mechanics of modern neural networks, essential skill in cloud comping and deploy the model onto cloud platform. The concepts of regularisation, pooling, optimisation momentum and convolution are introduced and applied in the field of computer vision neural networks. In this subject, Amazon is used to apply machine learning optimisation to machine learning tasks. This methodology of using machine learning for optimisation greatly enhances the outcomes of model development and removes some of the intuition needed for model development. At the conclusion of the subject, students will provide a detailed computer vision project plan using industry standard planning method.",
        "learning_outcomes": "demonstrate and apply advanced theoretical and technical knowledge of neural network to an industry or research problemdevelop multi-layer perceptron and convolution neural networksprogrammatically interact with AWS using Python Jupyter Notebooksdevelop and deploy machine learning models on AWS",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Essay (including multi-draft) 1 - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Case study analysis - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Project report - (50%) - Individual",
                "percent_weighting": 50
            }
        ]
    },
    "MA4601": {
        "name": "Data Science Honours Project, Part 1 of 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA3831, MA3212",
        "prerequisites_subjects": [
            "MA3212",
            "MA3831"
        ],
        "description": "This subject will prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on data science.",
        "learning_outcomes": "Interpret and assess literature related to a current research topic in data scienceFormulate a research problem and synthesise knowledge of technical skills and context to develop methodologies to solve a research problemCommunicate theoretical and applied data science knowledge to present methodology of a data science problem in written and oral form",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Cairns Nguma-bada, Study Period 3, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Thesis/dissertation - (90%) - Individual",
                "percent_weighting": 90
            }
        ]
    },
    "MA4602": {
        "name": "Data Science Honours Project, Part 2 of 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA4601",
        "prerequisites_subjects": [
            "MA4601"
        ],
        "description": "This subject completes the research project commenced in MA4601. Students will implement, evaluate and report on an open problem in data science using skills and techniques acquired during their studies.",
        "learning_outcomes": "Implement and experiment with algorithms in data science to gain insights and understanding of a research problemAnalyse and synthesise knowledge of results and context to identify solutions to a research problemCommunicate theoretical and applied data science knowledge to write a substantial research dissertation and present orally to both technical and non-technical audiences",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Thesis/dissertation - (90%) - Individual",
                "percent_weighting": 90
            }
        ]
    },
    "PH1001": {
        "name": "Preparatory Physics",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This algebra-based subject is designed to give students the necessary knowledge and skills, both computational and practical, to analyse real physical problems and to solve them using sound physical principles and mathematics. The subject is comprised of many topics representing aspects of introductory physics relevant to subsequent courses in physics, and other courses in the College of Science and Engineering, and the University. The theme of PH1001 responds to the questions \"How does it work?\" and \"Why is it so?\" by relating specific observable phenomena to the Laws of Physics. This is an introduction to the principles behind physics with examples and topics covering the life sciences, geology, and engineering.",
        "learning_outcomes": "apply the use of knowledge and concepts to explain physical observationsidentify a broad set of the basic principles of fundamental physicsdemonstrate the skills of measurement and observation on selected phenomenacompose mathematical solutions for various problems and observations",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Test 1 - 10% Test 2 - 10% Online quizzes - 10% - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "PH1005": {
        "name": "Advanced Stream Physics 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Maths B or MA1020 or MA0020 or MA1000 or MA1008 OR admission to 116209, 116409 or 116309. Allow concurrent for MA1000 and MA1008",
        "prerequisites_subjects": [
            "MA1020",
            "MA0020",
            "MA1000",
            "MA1008"
        ],
        "description": "This calculus-based subject covers topics in mechanics which forms the basis for further studies in engineering (statics and dynamics) as well as physics. This subject will cover experimental data analysis, vectors, kinematics, projectile motion, Newtonian mechanics, kinetic energy, potential energy and work, conservation of energy, centre-of-mass and momentum, conservation of momentum for systems of particles, rotational kinematics and dynamics.",
        "learning_outcomes": "translate, comprehend, or interpret the information in a word problem while deciding on the relevant principles and diagrams necessary to solve fundamental problems in mechanicsselect, identify, and use the appropriate data and physics principles to complete a problem or task, including the manipulation of mathematical entities to solve fundamental problems in mechanicsrecognize information, concepts, and principles of fundamental mechanics, including the correct use of physics terminology and definitionsintegrate and analyse experimental data using mathematical techniques in order to interpret experimental or observational data",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Log/logbook - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "PH1007": {
        "name": "Advanced Stream Physics 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "((Maths B or equivalent or MA1020 or MA0020) and PH1005) or (Physics and Maths C)",
        "prerequisites_subjects": [
            "MA0020",
            "PH1005",
            "MA1020"
        ],
        "description": "This calculus-based subject is an introduction to special topics in Physics. The special topics in any given year may include: thermodynamics, special relativity, and nuclear and particle physics. There is also a laboratory component which introduces electric circuits, physical optics, and laboratory projects.",
        "learning_outcomes": "recognize information, concepts, and principles of fundamental electric circuits and modern physics, including the correct use of terminology and definitionsselect, identify, and use the appropriate data and physics principles to complete a problem or task, including the manipulation of mathematical entities to solve problems in modern physics and electric circuitsassess experimental data using specific standards and criteria, including identifying, describing and justifying the best approach to solving an experimental problemcommunicate experimental/observational data using a logbook, and compose a final report under the direction of a style manual",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (45%) - Individual",
                "percent_weighting": 45
            },
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (25%) - Individual",
                "percent_weighting": 25
            }
        ]
    },
    "PH2002": {
        "name": "Classical Mechanics and Quantum Physics 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1003 AND PH1005 AND (PH1006 OR PH1007 OR (EG1012 AND EG1011))",
        "prerequisites_subjects": [
            "MA1003",
            "EG1012",
            "PH1007",
            "EG1011",
            "PH1006",
            "PH1005"
        ],
        "description": "Quantum physics - Schrodinger equation, eigenfunctions, measurements and eigenvalues, solutions for 1-dimensional systems, concepts of atomic, molecular, solid state and particle physics. Classical mechanics, waves and vibrations.",
        "learning_outcomes": "select and evaluate computational and/or theoretical techniques and tools in order to conduct an investigationcommunicate the theoretical concepts, and mathematical calculations, of an investigation with an oral and written presentationsolve problems in Classical and Quantum Mechanics, using the necessary physics concepts, principles, and discipline areas of mathematics",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Log/logbook - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "PH2006": {
        "name": "Marine Physics",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "This is a physical oceanography subject suitable for all students studying the marine environment. It provides an overview of the physical properties of the oceans of the world but has a special focus on the physical conditions of Australian coastal oceanography. This includes temperature and salinity signatures of water types; water, salt and heat budgets of the oceans; surface properties; and circulation of the oceans. This subject does not require calculus based mathematics but considerable use of algebra will be developed with the students. It is a quantitative subject. The laboratory sessions cover instruments and methods. A one day field trip to carry out measurement of physical parameters of hydrodynamics will be organized. This year we will be measuring the salinity in Cleveland Bay from the University research vessel R.V. James Kirby",
        "learning_outcomes": "solve mathematical and numerical problems related to the content, concepts and methods of physical oceanographyintegrate data measurements from an oceanographic field trip around Cleveland Bay using instruments and standard experimental methodologypresent measurements using graphical and mathematical methodology, with concern for experimental uncertainty",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Practicals and reports 15%; Field trips and report 10%; and Class participation 5% - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "PH2009": {
        "name": "Advanced Marine Physics",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH1005 AND MA1000",
        "prerequisites_subjects": [
            "PH1005",
            "MA1000"
        ],
        "description": "This is an advanced physical oceanography subject suitable for physics students studying the marine environment. It provides an overview of the physical properties of the oceans of the world but has a special focus on the physical conditions of Australian coastal oceanography. This includes temperature and salinity signatures of water types; water, salt and heat budgets of the oceans; surface properties; and circulation of the oceans. This subject will require calculus based mathematics; it is a quantitative subject. The laboratory sessions cover instruments and methods. A one day field trip to carry out measurement of physical parameters of hydrodynamics will be organized.",
        "learning_outcomes": "solve mathematical and numerical problems related to the content, concepts and methods of physical oceanographyintegrate data measurements from an oceanographic field trip using instruments and standard experimental methodologypresent measurements using graphical and mathematical methodology, with concern for experimental uncertainty",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Participation > Class participation - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Lab/Practical report - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "PH2019": {
        "name": "Introduction to Electromagnetism Optics and Early Quantum",
        "college": "College of Science and Engineering",
        "prerequisites_string": "(EG1012 OR PH1005) AND MA1003",
        "prerequisites_subjects": [
            "MA1003",
            "EG1012",
            "PH1005"
        ],
        "description": "The fundamental principles of Electromagnetism, Optics and Early Quantum are taught to give student the basic skills required for more advanced studies in Engineering and Physics. Electromagnetism is one of the fundamental areas of Physics that has applications in wide variety of applications. The work covered is a precursor to applications to subjects such as Antenna design, EM shielding, propagation, electro-machinery, fibre-optic communications, mobile phone technology and computer technology to mention just a few. Topics include Gauss's Law, Biot Savart law, Ampere's law, plane waves, geometric optics, diffraction, interference, and early quantum.",
        "learning_outcomes": "demonstrate an understanding of the concepts and laws fundamental to Advanced Optics, and Electromagnetismsolve problems in Advanced Optics, and Electromagnetism, using the necessary physics concepts, principles, and disciplinary areas of mathematicsundertake laboratory work by gathering, analysing, and documenting experimental and observational datacommunicate experimental physics data, results, and analysis by producing a workbook detailing experimental observations",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Laboratory - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "PH2023": {
        "name": "Human Biomechanics 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH1001 or PH1005",
        "prerequisites_subjects": [
            "PH1005",
            "PH1001"
        ],
        "description": "This subject will give students an introduction into how foundational physics concepts can be applied to human movement, and used to improve performance and prevent injury. Within practical classes, students will have the opportunity to learn how the biomechanical parameters discussed in lectures can be measured in both laboratory and field environments, and used to improve performance. Students will also learn about the mechanics of specific structures within the human body such as bone, joints, and skeletal muscle. Once students have examined these specific structures, the functional aspects of the upper extremity, lower extremity, and back are investigated. The causes of common injuries and the resulting biomechanical and anatomical adaptations are discussed along with the effects of aging. Students will also learn how to quantify load at the major joints and basic discussion around how this knowledge can be used is undertaken.",
        "learning_outcomes": "describe the structure and function of the human musculoskeletal system, particularly under movement conditionsdefine and apply the fundamental concepts of mechanics applicable to the study of human movementmeasure biomechanical characteristics of sport and exercise activities using fundamental biomechanical equipmentinterpret data collected using fundamental biomechanical equipment",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Examination - In class - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Workshop quizzes - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "PH2048": {
        "name": "Medical and Radiation Physics",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH1007 AND MA1003",
        "prerequisites_subjects": [
            "MA1003",
            "PH1007"
        ],
        "description": "This subject introduces topics on nuclear physics, radiation physics, and their applications to medicine and health sciences. It gives an overview of the interactions between radiation and matter, and their importance to nuclear medicine, radiotherapy, medical imaging and radiation protection.",
        "learning_outcomes": "solve mathematical, numerical, and computation problems relating to radiation transport, dosimetry, protection and/or therapiesundertake laboratory work collecting, analysing, and interpreting data for nuclear instrumentation and/or ionizing radiation applicationsdescribe and discuss the quantitative aspects of nuclear physics and radiation physics, and the theoretical concepts that underpin themappraise the risks associated with radiation hazards and practice basic safety procedures for handling radioactive sources",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Examination (College administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Lab/Practical report - (30%) - Group & Individual",
                "percent_weighting": 30
            }
        ]
    },
    "PH2240": {
        "name": "Atomic and Nuclear Physics",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH2002 AND MA1003",
        "prerequisites_subjects": [
            "PH2002",
            "MA1003"
        ],
        "description": "An understanding of the nature of atoms is developed by examining the basic quantum mechanical model for the electronic structure of atoms. Central to this model is the interaction of atoms with light and electric and magnetic fields. Applications that are important for our standards of time and length will be discussed. We then delve further into the atom and examine the structure of the nucleus. The basic concepts and theories of nuclear physics are developed as well as an understanding of the applications of nuclear science. Topics in atomic and nuclear physics covered include: Fundamentals of atomic structure: The hydrogen atom; Describing multi-electron atoms: Spin-Orbit Coupling; Atomic Radiation; Atoms in Magnetic Fields; Applications of Atomic Physics; Nuclear properties; Nuclear models; Nuclear reactions; Radiation detectors; Biological Effects of radiation; and Applications selected from the following: medicine, nuclear power production, industrial applications & environmental issues.",
        "learning_outcomes": "demonstrate an understanding of the concepts and laws fundamental to the electronic and nuclear structure of atomssolve mathematical and numerical problems related to the structure of atoms and the effect of ionizing radiation on the body and the environmentexhibit an appreciation of the influence of atomic and nuclear physics on modern scientific development, and describe its role and relevance in everyday livingundertake laboratory work by gathering, analysing, and documenting experimental and observational data through various aspects related to both atomic and nuclear physics",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Log/logbook - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "PH3002": {
        "name": "Quantum Physics 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA2000 AND PH2002",
        "prerequisites_subjects": [
            "PH2002",
            "MA2000"
        ],
        "description": "Quantum mechanics: mathematical formalism and applications",
        "learning_outcomes": "solve mathematical and numerical problems associated with the theoretical concepts covered in a selection of topics in advanced quantum mechanicsexhibit an appreciation of the role, relevance, and application of advanced quantum mechanics on modern scientific technologyundertake, and demonstrate, computational investigation associated with the theoretical concepts covered, and to write reports based on that analysisundertake laboratory work by gathering, analysing, and documenting experimental and observational data through various aspects related to application of quantum mechanics",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (15%) - Individual",
                "percent_weighting": 15
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (15%) - Individual",
                "percent_weighting": 15
            }
        ]
    },
    "PH3006": {
        "name": "Oceanography and Meteorology",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA2000 and PH2019",
        "prerequisites_subjects": [
            "MA2000",
            "PH2019"
        ],
        "description": "This course is divided equally into Meteorology and Oceanography. Topics in meteorology include the atmospheric environment - composition, vertical structure, radiative transfer, solar energy budget, enhanced greenhouse effect - simple global models, predictions for the future, atmospheric thermodynamics and humidity, thermodynamic diagrams, lapse rate and stability, surface boundary layer, turbulence balance equations, turbulent transport equations, vertical wind profile, logarithmic wind profile, friction velocity and roughness length, computation of vertical fluxes in the surface boundary layer. Topics in Oceanography include: properties of seawater, stability, diffusion, waves",
        "learning_outcomes": "solve mathematical and numerical problems in atmospheric thermodynamics, dynamic meteorology and physical oceanography related to the theoretical conceptsemploy sensors and integrate data measurements from an oceanographic field trip around Cleveland Baycommunicate experimental physics data, results, and analysis using written analysis to detail experimental observations",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Written > Test/Quiz 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "PH3008": {
        "name": "Statistical Mechanics and Transport",
        "college": "College of Science and Engineering",
        "prerequisites_string": "PH2019 AND PH2002 AND MA2000",
        "prerequisites_subjects": [
            "PH2002",
            "MA2000",
            "PH2019"
        ],
        "description": "Equilibrium statistical mechanics/ensemble theory. Classical and Quantum Statistics. Applications eg ideal gases, heat capacity, magnetism, Bose-Einstein condensation, Fermi-Dirac gases. If time permits, introduction to non-equilibrium statistical mechanics and transport theory.",
        "learning_outcomes": "solve mathematical, analytical, and numerical problems associated with Classical and Quantum Statistics, equilibrium and non-equilibrium statistical mechanics, and transport theoryinvestigate the connection between the behaviours observed in the physical world and the mathematical and physical concepts behind themexplain how approximation and limiting cases can aid in solving analytically intractable problems in an analytical and numerical manneremploy numerical/simulation/computational techniques to model statistical physics processes in real systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Log/logbook - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            }
        ]
    },
    "PH3021": {
        "name": "Physics of the Earth, Solar System, and Universe",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA2000 AND PH2002 AND PH2019",
        "prerequisites_subjects": [
            "PH2002",
            "MA2000",
            "PH2019"
        ],
        "description": "This is an advanced course suitable for Physics students interested in various aspects of Earth, planetary, and space science. It covers an overview of the structure and evolution of Earth, planets, and astrophysical bodies, via the application of various theoretical concepts and fundamental principles of Physics. Proposed topics include: Earth structure, composition, and dynamics; global seismology, wave propagation, and free oscillations; plate structure, tectonics, and convection; earthquake sources, mechanism, and location; solar system formation; structure and properties of other planets; stellar formation and evolution; helioseismology; black holes; the cosmic microwave background; early Universe. The laboratory sessions will require use of Geophysical instruments as well as computational codes and analyses.",
        "learning_outcomes": "Demonstrate and apply theoretical concepts to describe quantitative aspects of Geophysics and AstrophysicsSolve mathematical, numerical, and computation problems relating to planetary or stellar properties, dynamics, and evolutionCollect, analyse, and interpret geophysical or astrophysical data, and produce a report to communicate experimental methods, observations, and analyses",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Problem task - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Lab/Practical report - (30%) - Group & Individual",
                "percent_weighting": 30
            }
        ]
    },
    "PH3024": {
        "name": "Human Biomechanics 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1000 AND (PH1005 OR PH2023 OR SP2003)",
        "prerequisites_subjects": [
            "SP2003",
            "PH2023",
            "PH1005",
            "MA1000"
        ],
        "description": "This subject has a large focus on how biomechanical principles can be used to quantitatively examine dynamic movement. Students will learn how to compute joint reaction forces, net joint moments, and muscle power, and examine how these measures and can be used to prevent injury, improve movement patterns in different pathologies, and improve sporting performance. Quantifying the reaction forces and moments during gait are looked at in detail, and normative data for a number of populations are discussed and compared. Within practical classes, students will have the opportunity to collect three-dimensional motion capture data and will practice how to analyse and interpret the data they collect using skills learnt in lectures. Students will also learn about the role of anthropometry in ergonomics and sports performance, and will learn how to obtain body segment properties from anthropometric tables.",
        "learning_outcomes": "define and apply complex concepts of mechanics applicable to the study of human movementdescribe, calculate, and interpret the biomechanical aspects of gait patternsmeasure biomechanical characteristics of sport and exercise activities using advanced biomechanical equipmentinterpret data collected using advanced biomechanical equipment",
        "availabilities": [
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Examination - In class - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Workshop quizzes - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "SC1022": {
        "name": "Essential Science",
        "college": "Academy Division",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "<i>Essential Science</i> is an interdisciplinary science subject wherein you will develop knowledge and understanding of scientific concepts and processes required for active participation in the 21st century. You will examine the role and relevance of science in society by exploring relevant and important issues that integrate science disciplines and link with technology. In this subject, you will have the opportunity to develop investigative skills through devising and implementing investigations; inquire and determine answers about natural or scientific phenomena; express positions that are scientifically informed; evaluate the validity of conclusions drawn by others about scientific matters; and reflect on the factors that influence the development of scientific knowledge. This subject will supplement student learning in the recognised science disciplines of Physics, Chemistry, Biology and Earth Science and prepare students for foundational science for study in the health disciplines.",
        "learning_outcomes": "devise and implement investigations using appropriate methods, techniques and equipment; work responsibly and safely in scientific contextscollect, accurately record, interpret and draw conclusions from primary and secondary datacommunicate information and ideas using scientific convention and terminologydemonstrate knowledge and understanding of foundational concepts and processes integral to the science disciplines of Physics, Chemistry, Biology and Earth Science",
        "availabilities": [
            "Cairns Nguma-bada, Trimester 1, Internal",
            "Cairns Nguma-bada, Trimester 2, Internal",
            "Cairns Nguma-bada, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Trimester 1, External",
            "Townsville Bebegu Yumba, Trimester 1, Internal",
            "Townsville Bebegu Yumba, Trimester 2, External",
            "Townsville Bebegu Yumba, Trimester 2, Internal",
            "Townsville Bebegu Yumba, Trimester 3, External",
            "Townsville Bebegu Yumba, Trimester 3, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Research report - (25%) - Individual",
                "percent_weighting": 25
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (35%) - Individual",
                "percent_weighting": 35
            }
        ]
    },
    "SC1101": {
        "name": "Science, Technology and Truth",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "An introduction to the development of science and technology, its methods, controversies, and fundamental role in society. The subject will examine approaches to science, key figures and their contributions, some of the big ideas of science, and future trends. It will encourage the development of critical thinking, academic collaboration, and the analysis and interpretation of ideas in science, and will provide an outstanding foundation for all students to become future change-makers regardless of their academic discipline.",
        "learning_outcomes": "convey scientific ideas, arguments and conclusions clearly and coherently through well-developed written communication and oral presentation skillsidentify and generate solutions to complex science Megatrends by applying scientific knowledge, innovation and creativity in a multidisciplinary group settingdemonstrate knowledge of the role and relevance of science and technology in society in the context of creating sustainable futures through the use of multidimensional analytical frameworksdescribe the iterative and testable nature of the scientific method and how scientific knowledge is createdretrieve and evaluate information from a range of sources and employ critical thinking to assess bias and identify fallaciesreflect on graduate employability by assessing your current skills, knowledge, experience and personal attributes with the goal of identifying gaps and mapping a personalised career action plan",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Test/Quiz 1 - (45%) - Individual",
                "percent_weighting": 45
            },
            {
                "title": "Oral > Presentation 1 - (20%) - Group & Individual",
                "percent_weighting": 20
            },
            {
                "title": "Written > Essay (including multi-draft) 1 - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "weekly Tutorial assignments - (25%) - Individual",
                "percent_weighting": 25
            }
        ]
    },
    "SC1102": {
        "name": "Modelling Natural Systems",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1020 or MA0020 or Senior Mathematics or equivalent.",
        "prerequisites_subjects": [
            "MA0020",
            "MA1020"
        ],
        "description": "By providing the bridge between theory and practice this subject will demonstrate how quantitative and computing methods can be used to describe and enhance our knowledge about natural systems. This subject will be presented by a series of motivating and in depth case studies that span a range of biophysical settings with an emphasis on applications relevant to tropical systems. Computing technologies (Microsoft Excel, R-studio and calculator) will assist with numerical calculations and graphical presentations.",
        "learning_outcomes": "translate between verbal, algebraic, numerical, visual and conceptual characterizations of a system to enhance knowledge about natural systemsreinforce the importance of biological and environmental scientists being quantitatively capable, and, mathematical scientists understanding biological and environmental phenomenaundertake basic computing tasks with increased confidence and demonstrate basic computing know-how",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Two assessment schemes may be applied. If Scheme 1 does not result in a passing grade then Scheme 2 is used: <b>Scheme 1:</b> 3 x Tests/Quizzes each worth 25% and 1 x Test/Quiz worth 5% <b>OR Scheme 2:</b> 4 x quizzes/tests each worth 5% and 1 x final exam worth 60% - (80%) - Individual",
                "percent_weighting": 80
            }
        ]
    },
    "SC1109": {
        "name": "Modelling Natural Systems-Advanced",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1000 or MA1009.",
        "prerequisites_subjects": [
            "MA1009",
            "MA1000"
        ],
        "description": "By providing the bridge between theory and practice this subject will demonstrate how mathematical and computer models can be used to describe and enhance our knowledge about natural systems. This subject will use a series of motivating and in-depth case studies that span a range of biophysical contexts with emphasis on applications relevant to tropical systems. Statistical programming (R) and single-variable calculus will be employed in the formulation and analysis of models, and their application to empirical data. This is a core subject for all students in the Bachelor of Science-Advanced and is recommended for all students in the Bachelor of Science who intend to transfer to the Advanced program after first year. Students majoring in Mathematics and Physics in the BSc are also encouraged to enrol.",
        "learning_outcomes": "demonstrate the advantages of being quantitatively skilled in a scientific environmentdefine key scientific concepts relevant to the case studytranslate between verbal, algebraic, numerical, graphical and conceptual characterisations of a systemintegrate methods and theories that span the disciplines of mathematics, science and computing to deliver a richer understanding of natural systemsassess how a natural system may respond under different circumstances through effective construction and application of relevant scientific modelling approachesformulate recommendations that promote the sustainability of natural systems",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination - In class - (45%) - Individual",
                "percent_weighting": 45
            },
            {
                "title": "Written > Problem task - (55%) - Individual",
                "percent_weighting": 55
            }
        ]
    },
    "SC2202": {
        "name": "Quantitative Methods in Science",
        "college": "College of Science and Engineering",
        "prerequisites_string": "SC1102 OR SC1109 OR ADMISSION TO BACHELOR OF BUSINESS AND ENVIRONMENTAL SCIENCE OR ADMISSION TO BACHELOR OF ENGINEERING (HONOURS)",
        "prerequisites_subjects": [
            "SC1109",
            "SC1102"
        ],
        "description": "An introduction to experimental and survey design and analysis. Topics include the principles of sampling design; hypothesis generation for experiments; collection of data; manipulations and interpretation of data; statistical methods used in science; and the use of data in scientific reports.",
        "learning_outcomes": "demonstrate sound knowledge of the basic principles that underpin sample selection, experimental design, data management, statistical theories, exploratory data analysis, and statistical analysis using basic linear modellingeffectively integrate and execute statistical theories and processes using R and RStudiocreate, retrieve, analyse, synthesise, and evaluate outputs produced from R and RStudio, including demonstrating rigorous workflow documentationintegrate statistical principles, methods, techniques and tools covered in this subject to plan and execute a statistical analysis",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (50%) - Individual",
                "percent_weighting": 50
            },
            {
                "title": "Written > Test/Quiz 1 - (30%) - Individual",
                "percent_weighting": 30
            },
            {
                "title": "Written > Problem task - (20%) - Individual",
                "percent_weighting": 20
            }
        ]
    },
    "SC2209": {
        "name": "Quantitative Methods in Science-Advanced",
        "college": "College of Science and Engineering",
        "prerequisites_string": "MA1003 and ((SC1109 plus 6 credit points of other Level 1 subjects) or admission in 116409)",
        "prerequisites_subjects": [
            "MA1003",
            "SC1109"
        ],
        "description": "An introduction to experimental design and analysis, with particular emphasis on the formulation of appropriate statistical models for data analysis, and their applications in science. Topics include the principles of scientific sampling design; hypothesis generation for scientific experiments; collection of scientific data; manipulations and interpretation of data; statistical methods used in science; and the use of data in scientific reports. In addition, basic probability and statistical theory, and computationally intensive statistical methods will be covered. This subject is compulsory for all Bachelor of Science-Advanced students and is recommended for any Bachelor of Science students who intend to enrol in the Advanced program or any students majoring in Maths or Physics who might prefer this subject over SC2202.",
        "learning_outcomes": "develop skills in the design, execution and reporting of scientific experiments and survey programsdemonstrate appropriate computer skills for data management analysis, and graphical presentationdesign and use appropriate statistical methods to analyse scientific dataapply statistical theory to identify and defend appropriate statistical methodology in research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Written > Test/Quiz 1 - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Weekly Assignment - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "SC3003": {
        "name": "Science Research Internship",
        "college": "College of Science and Engineering",
        "prerequisites_string": "15 credit points of AQ, BC, BS, BZ, CH, EV, EA, MA, MB, PH or SC science level 2 subjects",
        "prerequisites_subjects": [],
        "description": "The Science Research Internship is an integral part of the core requirements for the Bachelor of Advanced Science. Students will be placed within research teams within the university or with one of its external partners, where they will complete a small research project. The research may be field or laboratory based. A member of the academic staff within the College of Science and Engineering will assume overall responsibility for the student, although a PhD student, research fellow or a collaborating researcher at an external organisation may supervise the day-to-day activities of the student. The research will be of a size and scope that can be completed in 100 hours and introduces the student to methods and techniques that have current relevance to their discipline and career in science. Students are responsible for finding their own supervisors before their enrolment into the subject is permitted. Email confirmation from the supervisor of \"consent to supervise, an intended study period of enrolment\" should be sent to the subject coordinator to initiate enrolment into this subject. Ideally, students should start looking for supervisors in their first or second year of study to ensure they have a plan before commencing their final year",
        "learning_outcomes": "Students will gain hands-on experience of working in a real research environment and will develop an appreciation of the challenges of scientific rigourStudents will develop an understanding of how members of a research team interact on day-to-day and longer-term basisStudents will gain experience in the application of techniques and approaches to real and current research problemsStudents will gain understanding of the ethics and workplace health and safety responsibilities and requirements of all research workers",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Mixed attendance, (Face to Face dates exist for this availability)",
            "Cairns Nguma-bada, Study Period 11, Mixed attendance, (Face to Face dates exist for this availability)",
            "Cairns Nguma-bada, Study Period 2, Mixed attendance, (Face to Face dates exist for this availability)",
            "Cairns Nguma-bada, Study Period 3, Mixed attendance, (Face to Face dates exist for this availability)",
            "Cairns Nguma-bada, Study Period 7, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Study Period 1, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Study Period 11, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Study Period 2, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Study Period 3, Mixed attendance, (Face to Face dates exist for this availability)",
            "Townsville Bebegu Yumba, Study Period 7, Mixed attendance, (Face to Face dates exist for this availability)"
        ],
        "assessment": [
            {
                "title": "Oral > Presentation 1 - (40%) - Individual",
                "percent_weighting": 40
            },
            {
                "title": "Internship supervisor's feedback - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Proposal - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Written > Research report - (40%) - Individual",
                "percent_weighting": 40
            }
        ]
    },
    "SC3010": {
        "name": "Sensors and Sensing for Scientists",
        "college": "College of Science and Engineering",
        "prerequisites_string": "BZ2001 OR SC2202 OR SC2209 OR SC2201",
        "prerequisites_subjects": [
            "SC2209",
            "SC2201",
            "BZ2001",
            "SC2202"
        ],
        "description": "This subject introduces the concept of sensors for measuring in our natural world. A variety of physical and chemical sensors will be considered and applied to marine, atmospheric, biological and soil/earth systems. Data acquisition and communication of sensors will be addressed along with the issues of uncertainties, sensitivity, selectivity, range, resolution etc. There will be a substantial experimental component to this subject that is partly discipline-based to give students application within their area of study",
        "learning_outcomes": "identify and distinguish the physical and chemical principles of various sensors, and sensor technologiesdefine the principles of measurement and uncertainty in order to integrate and analyse the numerical data gathered by sensorsconstruct solutions, using sensors, from various applications of data acquisition and communications systemsapply sensor technologies applicable to various scientific disciplines, while carrying out investigations and analysis of data collected in the field",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Examination (centrally administered) - (45%) - Individual",
                "percent_weighting": 45
            },
            {
                "title": "Written > Examination - In class - (10%) - Individual",
                "percent_weighting": 10
            },
            {
                "title": "Technical Report: 15% Oral defence: 5% - (20%) - Individual",
                "percent_weighting": 20
            },
            {
                "title": "Performance/Practice/Product > Practical assessment/practical skills demonstration - (25%) - Individual",
                "percent_weighting": 25
            }
        ]
    },
    "SC3901": {
        "name": "Special Topic 1",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "An independent study and/or research devoted to a topic not available through structured coursework. The subject is to be developed in consultation with a member of staff from the College of Science and Engineering and the student's course coordinator. To request enrolment in this subject student's should (1) attain approval from a research supervisor (usually an academic or research staff member in the College), (2) identify a project in consultation with the supervisor, and (3) email confirmation from supervisor and a brief description of the project to the subject coordinator.",
        "learning_outcomes": "the ability to plan, conduct and manage research in their disciplinethe ability to formulate and solve research problemsthe ability to understand theoretical concepts in a range of topics which give background to the researchthe capacity to work independentlygain experience in problem-solving and scientific decision- makingdevelop skills in preparing and presenting written technical reports and/or oral presentations",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 11, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Cairns Nguma-bada, Study Period 3, Internal",
            "Cairns Nguma-bada, Study Period 7, Internal",
            "JCU Singapore, Study Period 51, Internal",
            "JCU Singapore, Trimester 2, Internal",
            "JCU Singapore, Trimester 3, Internal",
            "Townsville Bebegu Yumba, Study Period 1, External",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 11, External",
            "Townsville Bebegu Yumba, Study Period 11, Internal",
            "Townsville Bebegu Yumba, Study Period 2, External",
            "Townsville Bebegu Yumba, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 3, External",
            "Townsville Bebegu Yumba, Study Period 3, Internal",
            "Townsville Bebegu Yumba, Study Period 7, External",
            "Townsville Bebegu Yumba, Study Period 7, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Research report",
                "percent_weighting": null
            }
        ]
    },
    "SC3902": {
        "name": "Special Topic 2",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "An independent study and/or research devoted to a topic not available through structured coursework. The subject is to be developed in consultation with a member of staff from the College of Science and Engineering and the student's course coordinator.",
        "learning_outcomes": "the ability to plan, conduct and manage research in their disciplinethe ability to formulate and solve research problemsthe ability to understand theoretical concepts in a range of topics which give background to the researchthe capacity to work independentlygain experience in problem-solving and scientific decision- makingdevelop skills in preparing and presenting written technical reports and/or oral presentations",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 11, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Cairns Nguma-bada, Study Period 3, Internal",
            "Cairns Nguma-bada, Study Period 7, Internal",
            "Townsville Bebegu Yumba, Study Period 1, External",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 11, External",
            "Townsville Bebegu Yumba, Study Period 11, Internal",
            "Townsville Bebegu Yumba, Study Period 2, External",
            "Townsville Bebegu Yumba, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 3, External",
            "Townsville Bebegu Yumba, Study Period 3, Internal",
            "Townsville Bebegu Yumba, Study Period 7, External",
            "Townsville Bebegu Yumba, Study Period 7, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Research report",
                "percent_weighting": null
            }
        ]
    },
    "SC4011": {
        "name": "Science Honours Type B (Full-Time) (Part 1 of 2)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4012": {
        "name": "Science Honours Type B (Full-Time) (Part 2 of 2)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4013": {
        "name": "Science Honours Type B (Part-Time) (Part 1 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": null,
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4014": {
        "name": "Science Honours Type B (Part-Time) (Part 2 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4015": {
        "name": "Science Honours Type B (Part-Time) (Part 3 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4016": {
        "name": "Science Honours Type B (Part-Time) (Part 4 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report. To support the project some time is spent developing content knowledge and associated skills in a coursework format.",
        "learning_outcomes": "identify theoretical content knowledge of relevance to a research domain and apply that knowledge to a research problemcritically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report - (70%) - Individual",
                "percent_weighting": 70
            },
            {
                "title": "Combination of exams and assignments - (30%) - Individual",
                "percent_weighting": 30
            }
        ]
    },
    "SC4111": {
        "name": "Science Honours Type A (Full-Time) (Part 1 of 2)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 9, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    },
    "SC4112": {
        "name": "Science Honours Type A (Full-Time) (Part 2 of 2)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    },
    "SC4113": {
        "name": "Science Honours Type A (Part-Time) (Part 1 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    },
    "SC4114": {
        "name": "Science Honours Type A (Part-Time) (Part 2 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    },
    "SC4115": {
        "name": "Science Honours Type A (Part-Time) (Part 3 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 1, Internal",
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal",
            "Townsville Bebegu Yumba, Study Period 2, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    },
    "SC4116": {
        "name": "Science Honours Type A (Part-Time) (Part 4 of 4)",
        "college": "College of Science and Engineering",
        "prerequisites_string": "Enrolment in the Bachelor of Science (Honours)",
        "prerequisites_subjects": [],
        "description": "These subjects prepare students for advanced research by examining how to plan, conduct and report on empirical investigations with an emphasis on science. In the first half of the chain the focus is on scoping out a research project and identifying an approach to investigating that project. In the second half of the chain the focus moves toward enacting a planned methodology and then synthesising the results of experiment with to produce a scientific report.",
        "learning_outcomes": "critically review and synthesise literature related to a current research topic in scienceformulate a research problem and synthesise information to develop methodologies and gain insights on the problemutilise a scientific methodology and then analyse and synthesise data and information to identify solutions to a research problemcommunicate a substantial piece of scientific research",
        "availabilities": [
            "Cairns Nguma-bada, Study Period 2, Internal",
            "Townsville Bebegu Yumba, Study Period 1, Internal"
        ],
        "assessment": [
            {
                "title": "Written > Project report",
                "percent_weighting": null
            }
        ]
    }
}